{"response":{"docs":[{"codeRepoURL":"https:\/\/github.com\/raquele\/GeNNet","repoDescription":"Integrated platform for unifying scientific workflow management and graph databases for transcriptome data analysis","repoName":"GeNNet","suggestName":"GeNNet","repo":"github","description":"There are many steps in analyzing transcriptome data, from the acquisition of raw data to the selection of a subset of representative genes that explain a scientific hypothesis. The data produced can be represented as networks of interactions among genes and these may additionally be integrated with other biological databases, such as Protein-Protein Interactions, transcription factors and gene annotation. However, the results of these analyses remain fragmented, imposing difficulties, either for posterior inspection of results, or for meta-analysis by the incorporation of new related data. Integrating databases and tools into scientific workflows, orchestrating their execution, and managing the resulting data and its respective metadata are challenging tasks. Additionally, a great amount of effort is equally required to run in-silico experiments to structure and compose the information as needed for analysis. Different programs may need to be applied and different files are produced during the experiment cycle. In this context, the availability of a platform supporting experiment execution is paramount. We present GeNNet, an integrated transcriptome analysis platform that unifies scientific workflows with graph databases for selecting relevant genes according to the evaluated biological systems. It includes GeNNet-Wf, a scientific workflow that pre-loads biological data, pre-processes raw microarray data and conducts a series of analyses including normalization, differential expression inference, clusterization and gene set enrichment analysis. A user-friendly web interface, GeNNet-Web, allows for setting parameters, executing, and visualizing the results of GeNNet-Wf executions. To demonstrate the features of GeNNet, we performed case studies with data retrieved from GEO, particularly using a single-factor experiment in different analysis scenarios. As a result, we obtained differentially expressed genes for which biological functions were analyzed. The results are integrated into GeNNet-DB, a database about genes, clusters, experiments and their properties and relationships. The resulting graph database is explored with queries that demonstrate the expressiveness of this data model for reasoning about gene interaction networks. GeNNet is the first platform to integrate the analytical process of transcriptome data with graph databases. It provides a comprehensive set of tools that would otherwise be challenging for non-expert users to install and use. Developers can add new functionality to components of GeNNet. The derived data allows for testing previous hypotheses about an experiment and exploring new ones through the interactive graph database environment. It enables the analysis of different data on humans, rhesus, mice and rat coming from Affymetrix","language":["HTML"],"publicationDOI":["10.7717\/peerj.3509"],"publicationTitle":["GeNNet: an integrated platform for unifying scientific workflows and graph databases for transcriptome data analysis"],"repoUpdatedDate":"2017-09-06T07:12:31Z","repoHomepage":"","institutions":["Academic editor Camillo Rosano","National Laboratory for Scientific Computing (LNCC)","National Institute of Infectology Evandro Chagas","National Institute of Cancer (INCA)","Computational Biology Keywords GeNNet"],"linkUrls":["github.com\/raquele\/GeNNet","dx.doi.org\/10.7717\/peerj.3509#supplemental-information","cran.r-project.org\/web\/packages\/RNeo4j","hub.docker.com\/r\/quelopes\/gennet\/","hub.docker.com","blog.docker.com\/2016\/08\/docker-hub-hits-5-billion-pulls\/"],"license":"No License","repoCreationDate":"2016-12-15T13:26:55Z","_version_":1582910204530393088,"name":"GeNNet","id":8,"suggestNamePrefix":"GeNNet","repoDownloads":0,"publicationDate":["0"],"repoForks":0,"authors":["Raquel L. Costa","Luiz Gadelha","Marcelo Ribeiro-Alves","Fábio Porto"]},{"codeRepoURL":"https:\/\/github.com\/ZFMK\/COGNATE","repoDescription":"","repoName":"COGNATE","suggestName":"COGNATE","repo":"github","description":"Background: The comparison of gene and genome structures across species has the potential to reveal major trends of genome evolution. However, such a comparative approach is currently hampered by a lack of standardization (e.g., Elliott TA, Gregory TR, Philos Trans Royal Soc B: Biol Sci 370:20140331, 2015). For example, testing the hypothesis that the total amount of coding sequences is a reliable measure of potential proteome diversity (Wang M, Kurland CG, Caetano-Anollés G, PNAS 108:11954, 2011) requires the application of standardized definitions of coding sequence and genes to create both comparable and comprehensive data sets and corresponding summary statistics. However, such standard definitions either do not exist or are not consistently applied. These circumstances call for a standard at the descriptive level using a minimum of parameters as well as an undeviating use of standardized terms, and for software that infers the required data under these strict definitions. The acquisition of a comprehensive, descriptive, and standardized set of parameters and summary statistics for genome publications and further analyses can thus greatly benefit from the availability of an easy to use standard tool. Results: We developed a new open-source command-line tool, COGNATE (Comparative Gene Annotation Characterizer), which uses a given genome assembly and its annotation of protein-coding genes for a detailed description of the respective gene and genome structure parameters. Additionally, we revised the standard definitions of gene and genome structures and provide the definitions used by COGNATE as a working draft suggestion for further reference. Complete parameter lists and summary statistics are inferred using this set of definitions to allow down-stream analyses and to provide an overview of the genome and gene repertoire characteristics. COGNATE is written in Perl and freely available at the ZFMK homepage (https:\/\/www.zfmk.de\/en\/COGNATE) and on github (https:\/\/github.com\/ZFMK\/COGNATE).Conclusion: The tool COGNATE allows comparing genome assemblies and structural elements on multiples levels (e.g., scaffold or contig sequence, gene). It clearly enhances comparability between analyses. Thus, COGNATE can provide the important standardization of both genome and gene structure parameter disclosure as well as data acquisition for future comparative analyses. With the establishment of comprehensive descriptive standards and the extensive availability of genomes, an encompassing database will become possible.","language":["Perl"],"publicationDOI":["10.1186\/s12864-017-3870-8"],"publicationTitle":["COGNATE: comparative gene annotation characterizer"],"repoUpdatedDate":"2017-10-18T18:26:04Z","repoHomepage":"","institutions":["Institut für Biologie I (Zoologie)","Zentrum für Molekulare Biodiversitätsforschung (zmb)"],"linkUrls":["github.com\/ZFMK\/COGNATE","standage.github.io\/AEGeAn","ftp.ncbi.nlm.nih.gov\/genomes\/","www.zfmk.de\/en\/COGNATE","ftp.ncbi.nlm.nih.gov\/genomes\/all\/","github.com\/ihh\/gfftools","rstb.royalsocietypublishing.org\/highwire\/filestream\/32237\/field_highwire_adjunct_files\/0\/rstb20140331supp1.xlsx","www.ncbi.nlm.nih.gov\/genome\/annotation_euk\/Apis_mellifera\/103\/"],"license":"https:\/\/github.com\/ZFMK\/COGNATE\/blob\/master\/LICENSE","repoCreationDate":"2017-03-31T13:44:13Z","_version_":1582909904514973696,"name":"COGNATE","id":6,"suggestNamePrefix":"COGNATE","repoDownloads":0,"publicationDate":["6\/19\/2017"],"repoForks":1,"authors":["Jeanne Wilbrandt","Bernhard Misof","Oliver Niehuis"]},{"codeRepoURL":"https:\/\/github.com\/samuroi\/SamuROI","repoDescription":"SamuROI - Structured analysis of multiple user-defined ROIs, an open source Python-based analysis environment for imaging data. ","repoName":"SamuROI","suggestName":"SamuROI","repo":"github","description":"The measurement of activity in vivo and in vitro has shifted from electrical to optical methods. While the indicators for imaging activity have improved significantly over the last decade, tools for analysing optical data have not kept pace. Most available analysis tools are limited in their flexibility and applicability to datasets obtained at different spatial scales. Here, we present SamuROI (Structured analysis of multiple user-defined ROIs), an open source Python-based analysis environment for imaging data. SamuROI simplifies exploratory analysis and visualization of image series of fluorescence changes in complex structures over time and is readily applicable at different spatial scales. In this paper, we show the utility of SamuROI in Ca2C-imaging based applications at three spatial scales: the micro-scale (i.e., sub-cellular compartments including cell bodies, dendrites and spines); the meso-scale, (i.e., whole cell and population imaging with single-cell resolution); and the macro-scale (i.e., imaging of changes in bulk fluorescence in large brain areas, without cellular resolution). The software described here provides a graphical user interface for intuitive data exploration and region of interest (ROI) management that can be used interactively within Jupyter Notebook: a publicly available interactive Python platform that allows simple integration of our software with existing tools for automated ROI generation and post-processing, as well as custom analysis pipelines. SamuROI software, source code and installation instructions are publicly available on GitHub and documentation is available online. SamuROI reduces the energy barrier for manual exploration and semi-automated analysis of spatially complex Ca2C imaging datasets, particularly when these have been acquired at different spatial scales.","language":["Python"],"publicationDOI":["10.3389\/fninf.2017.00044"],"publicationTitle":["SamuROI, a Python-Based Software Tool for Visualization and Analysis of Dynamic Time Series Imaging at Multiple Spatial Scales"],"repoUpdatedDate":"2017-09-16T16:17:30Z","repoHomepage":"http:\/\/samuroi.readthedocs.io\/en\/latest","institutions":["Berlin Institute of Health (BIH)","Bernstein Center for Computational Neuroscience","Cluster of Excellence 'Neurocure'","DZNE-German Center for Neurodegenerative Disease","University of Otago","Einstein Center for Neuroscience","Humboldt Universität Berlin","Neuroscience Research Center","These authors have contributed"],"linkUrls":["www.jax.org\/strain\/024105","github.com\/samuroi\/SamuROI"],"license":"MIT License","repoCreationDate":"2016-09-05T15:55:20Z","_version_":1582909878423257088,"name":"SamuROI","id":5,"suggestNamePrefix":"SamuROI","repoDownloads":0,"publicationDate":["0"],"repoForks":2,"authors":["Martin Rueckl","Stephen C. Lenzi","Laura Moreno-Velasquez","Daniel Parthier","Dietmar Schmitz","Sten Ruediger","Friedrich W. Johenning"]},{"codeRepoURL":"https:\/\/github.com\/gabora\/visid","repoDescription":"Visualization of Identifiability Problems in Dynamic Biochemical Models ","repoName":"visid","suggestName":"visid","repo":"github","description":"Background: Kinetic models of biochemical systems usually consist of ordinary differential equations that have many unknown parameters. Some of these parameters are often practically unidentifiable, that is, their values cannot be uniquely determined from the available data. Possible causes are lack of influence on the measured outputs, interdependence among parameters, and poor data quality. Uncorrelated parameters can be seen as the key tuning knobs of a predictive model. Therefore, before attempting to perform parameter estimation (model calibration) it is important to characterize the subset(s) of identifiable parameters and their interplay. Once this is achieved, it is still necessary to perform parameter estimation, which poses additional challenges. Methods: We present a methodology that (i) detects high-order relationships among parameters, and (ii) visualizes the results to facilitate further analysis. We use a collinearity index to quantify the correlation between parameters in a group in a computationally efficient way. Then we apply integer optimization to find the largest groups of uncorrelated parameters. We also use the collinearity index to identify small groups of highly correlated parameters. The results files can be visualized using Cytoscape, showing the identifiable and non-identifiable groups of parameters together with the model structure in the same graph. Results: Our contributions alleviate the difficulties that appear at different stages of the identifiability analysis and parameter estimation process. We show how to combine global optimization and regularization techniques for calibrating medium and large scale biological models with moderate computation times. Then we evaluate the practical identifiability of the estimated parameters using the proposed methodology. The identifiability analysis techniques are implemented as a MATLAB toolbox called VisId, which is freely available as open source from GitHub (https:\/\/github.com\/gabora\/visid).Conclusions: Our approach is geared towards scalability. It enables the practical identifiability analysis of dynamic models of large size, and accelerates their calibration. The visualization tool allows modellers to detect parts that are problematic and need refinement or reformulation, and provides experimentalists with information that can be helpful in the design of new experiments.","language":["Matlab"],"publicationDOI":["10.1186\/s12918-017-0428-y"],"publicationTitle":["Parameter identifiability analysis and visualization in large-scale kinetic models of biosystems"],"repoUpdatedDate":"2017-05-08T07:52:20Z","repoHomepage":"","linkUrls":["www.mpi-magdeburg.mpg.de\/1094756\/rrqr","github.com\/gabora\/visid","sites.google.com\/site\/amigo2toolbox\/download","github.com\/gabora\/visid\/tree\/master\/case_"],"license":"https:\/\/github.com\/gabora\/visid\/blob\/master\/LICENSE.txt","repoCreationDate":"2016-11-14T15:37:03Z","_version_":1583538803415449600,"name":"visid","id":10,"suggestNamePrefix":"visid","repoDownloads":0,"publicationDate":["4\/25\/2017"],"repoForks":0,"authors":["Attila Gábor","Alejandro F. Villaverde","Julio R. Banga"]},{"codeRepoURL":"https:\/\/github.com\/3DGenomes\/tadbit","repoDescription":"TADbit is a complete Python library to deal with all steps to analyze, model and explore 3C-based data. With TADbit the user can map FASTQ files to obtain raw interaction binned matrices (Hi-C like matrices), normalize and correct interaction matrices, identify and compare the so-called Topologically Associating Domains (TADs), build 3D models from the interaction matrices, and finally, extract structural properties from the models. TADbit is complemented by TADkit for visualizing 3D models","repoName":"TADbit","suggestName":"tadbit","repo":"github","description":"The sequence of a genome is insufficient to understand all genomic processes carried out in the cell nucleus. To achieve this, the knowledge of its three-dimensional architecture is necessary. Advances in genomic technologies and the development of new analytical methods, such as Chromosome Conformation Capture (3C) and its derivatives, provide unprecedented insights in the spatial organization of genomes. Here we present TADbit, a computational framework to analyze and model the chromatin fiber in three dimensions. Our package takes as input the sequencing reads of 3C-based experiments and performs the following main tasks: (i) pre-process the reads, (ii) map the reads to a reference genome, (iii) filter and normalize the interaction data, (iv) analyze the resulting interaction matrices, (v) build 3D models of selected genomic domains, and (vi) analyze the resulting models to characterize their structural properties. To illustrate the use of TADbit, we automatically modeled 50 genomic domains from the fly genome revealing differential structural features of the previously defined chromatin colors, establishing a link between the conformation of the genome and the local chromatin composition. TADbit provides three-dimensional models built from 3C-based experiments, which are ready for visualization and for characterizing their relation to gene expression and epigenetic states. TADbit is an open-source Python library available for download from https:\/\/github.com\/3DGenomes\/tadbit.","language":["Python"],"publicationDOI":["None"],"publicationTitle":["Automatic analysis and 3D-modelling of Hi-C data using TADbit reveals structural features of the fly chromatin colors"],"repoUpdatedDate":"2017-10-28T06:33:04Z","repoHomepage":"","institutions":["3 Universitat Pompeu Fabra (UPF)","This is a PLOS Computational Biology Software paper"],"linkUrls":["github.com\/3DGenomes\/tadbit","3dgenomes.github.io\/TADbit","github.io\/TADbit"],"license":"GNU General Public License v3.0","repoCreationDate":"2013-08-29T12:31:54Z","_version_":1582909940796751872,"name":"tadbit","id":7,"suggestNamePrefix":"tadbit","repoDownloads":0,"publicationDate":["7\/3\/2017"],"repoForks":37,"authors":["Editor: Andreas Prlic","UNITED STATES","FrancË ois Serra","Davide BauÁ","Mike Goodstadt","David Castillo","Guillaume J. Filion","Marc A. Marti-Renom"]},{"codeRepoURL":"https:\/\/github.com\/Ensembl\/ensembl-vep","repoDescription":"The Variant Effect Predictor predicts the functional effects of genomic variants","repoName":"ensembl-vep","suggestName":"DoriTool","repo":"github","description":"The emergence of high-throughput data in biology has increased the need for functional in silico analysis and prompted the development of integrative bioinformatics tools to facilitate the obtainment of biologically meaningful data. In this paper, we present DoriTool, a comprehensive, easy, and friendly pipeline integrating biological data from different functional tools. The tool was designed with the aim to maximize reproducibility and reduce the working time of the researchers, especially of those with limited bioinformatics skills, and to help them with the interpretation of the results. DoriTool is based upon an integrative strategy implemented following a modular design pattern. Using scripts written in Bash, Perl and R, it performs a functional in silico analysis annotation at mutation\/variant level, gene level, pathway level and network level by combining up-to-date functional and genomic data and integrating also third-party bioinformatics tools in a pipeline. DoriTool uses GRCh37 human assembly and online mode. DoriTool provides nice visual reports M P 3 5 :: 3 1 8 7 y 01 ra \/2 lirLb \/829 :ybd icade .-347 leaod ioBm .1042 nowD LAUC .1914","language":["Perl"],"publicationDOI":["10.1159\/000477561"],"publicationTitle":["DoriTool: A Bioinformatics Integrative Tool for Post-Association Functional Annotation"],"repoUpdatedDate":"2017-11-01T20:14:39Z","repoHomepage":"http:\/\/www.ensembl.org\/vep","institutions":["Centro de Investigación Biomédica en red Cáncer","Evangelina López de Maturana","Spanish National Cancer Research Centre","Universidad San Pablo CEU","Isabel Martín-Antoniano and Lola Alonso Genetic and Molecular Epidemiology Group Spanish National Cancer Research Center (CNIO) C\/Melchor Fernandez Almagro","Núria Malats","Spanish National Cancer Research Centre (CNIO)"],"linkUrls":["CRAN.R-project.org\/package=gProfileR","www.bioconductor.org\/packages\/release\/data\/annotation\/manuals\/org.Hs.eg.db\/man\/","github.com\/Ensembl\/ensembl-vep","www.karger.com\/doi\/10.1159\/000477561","github.com\/doritool","bioconductor.org\/packages\/org.Hs.eg.db\/","doritool.github.io\/","bioconductor.org\/packages\/release\/bioc\/html\/topGO.html","choosealicense.com\/licenses\/agpl-3.0\/#"],"license":"No License","repoCreationDate":"2016-04-05T12:08:24Z","_version_":1582909807239626752,"name":"DoriTool","id":2,"suggestNamePrefix":"DoriTool","repoDownloads":0,"publicationDate":["5\/17\/2017"],"repoForks":23,"authors":["Isabel Martín-Antoniano","Lola Alonso","Miguel Madrid"]},{"codeRepoURL":"https:\/\/github.com\/uio-cels\/NucDiff","repoDescription":"In-depth characterization and annotation of differences between two sets of DNA sequences","repoName":"NucDiff","suggestName":"NucDiff","repo":"github","description":"Background: Comparing sets of sequences is a situation frequently encountered in bioinformatics, examples being comparing an assembly to a reference genome, or two genomes to each other. The purpose of the comparison is usually to find where the two sets differ, e.g. to find where a subsequence is repeated or deleted, or where insertions have been introduced. Such comparisons can be done using whole-genome alignments. Several tools for making such alignments exist, but none of them 1) provides detailed information about the types and locations of all differences between the two sets of sequences, 2) enables visualisation of alignment results at different levels of detail, and 3) carefully takes genomic repeats into consideration. Results: We here present NucDiff, a tool aimed at locating and categorizing differences between two sets of closely related DNA sequences. NucDiff is able to deal with very fragmented genomes, repeated sequences, and various local differences and structural rearrangements. NucDiff determines differences by a rigorous analysis of alignment results obtained by the NUCmer, delta-filter and show-snps programs in the MUMmer sequence alignment package. All differences found are categorized according to a carefully defined classification scheme covering all possible differences between two sequences. Information about the differences is made available as GFF3 files, thus enabling visualisation using genome browsers as well as usage of the results as a component in an analysis pipeline. NucDiff was tested with varying parameters for the alignment step and compared with existing alternatives, called QUAST and dnadiff. Conclusions: We have developed a whole genome alignment difference classification scheme together with the program NucDiff for finding such differences. The proposed classification scheme is comprehensive and can be used by other tools. NucDiff performs comparably to QUAST and dnadiff but gives much more detailed results that can easily be visualized. NucDiff is freely available on https:\/\/github.com\/uio-cels\/NucDiff under the MPL license.","language":["Python"],"publicationDOI":["10.1186\/s12859-017-1748-z"],"publicationTitle":["NucDiff: in-depth characterization and annotation of differences between two sets of DNA sequences"],"repoUpdatedDate":"2017-10-26T03:55:06Z","repoHomepage":"","institutions":["University of Oslo","Oslo University Hospital","Norwegian Veterinary Institute"],"linkUrls":["github.com\/uio-cels\/NucDiff"],"license":"Mozilla Public License 2.0","repoCreationDate":"2016-09-13T11:55:54Z","_version_":1582909842003066880,"name":"NucDiff","id":4,"suggestNamePrefix":"NucDiff","repoDownloads":0,"publicationDate":["7\/4\/2017"],"repoForks":1,"authors":["Ksenia Khelik","Karin Lagesen","Geir Kjetil Sandve","Torbjørn Rognes","Alexander Johan Nederbragt"]},{"codeRepoURL":"https:\/\/github.com\/hao-peng\/DEIsoM","repoDescription":"RNASeq Project","repoName":"DEIsoM","suggestName":"DEIsoM","repo":"github","description":"Motivation: High-throughput mRNA sequencing (RNA-Seq) is a powerful tool for quantifying gene expression. Identification of transcript isoforms that are differentially expressed in different conditions, such as in patients and healthy subjects, can provide insights into the molecular basis of diseases. Current transcript quantification approaches, however, do not take advantage of the shared information in the biological replicates, potentially decreasing sensitivity and accuracy. Results: We present a novel hierarchical Bayesian model called Differentially Expressed Isoform detection from Multiple biological replicates (DEIsoM) for identifying differentially expressed (DE) isoforms from multiple biological replicates representing two conditions, e.g. multiple samples from healthy and diseased subjects. DEIsoM first estimates isoform expression within each condition by (1) capturing common patterns from sample replicates while allowing individual differences, and (2) modeling the uncertainty introduced by ambiguous read mapping in each replicate. Specifically, we introduce a Dirichlet prior distribution to capture the common expression pattern of replicates from the same condition, and treat the isoform expression of individual replicates as samples from this distribution. Ambiguous read mapping is modeled as a multinomial distribution, and ambiguous reads are assigned to the most probable isoform in each replicate. Additionally, DEIsoM couples an efficient variational inference and a post-analysis method to improve the accuracy and speed of identification of DE isoforms over alternative methods. Application of DEIsoM to an hepatocellular carcinoma (HCC) dataset identifies biologically relevant DE isoforms. The relevance of these genes\/isoforms to HCC are supported by principal component analysis (PCA), read coverage visualization, and the biological literature. Availability and implementation: The software is available at https:\/\/github.com\/hao-peng\/DEIsoM Contact: pengh@alumni.purdue.edu Supplementary information: Supplementary data are available at Bioinformatics online.","language":["C++"],"publicationDOI":["10.1093\/bioinformatics\/btx357"],"publicationTitle":["DEIsoM: a hierarchical Bayesian model for identifying differentially expressed isoforms using biological replicates"],"repoUpdatedDate":"2016-11-15T15:25:03Z","repoHomepage":"","institutions":["Purdue University","Department of Computer Science","Eli Lilly and Company"],"linkUrls":["github.com\/hao-peng\/DEIsoM"],"license":"No License","repoCreationDate":"2013-05-06T05:17:08Z","_version_":1583536884944994304,"name":"DEIsoM","id":9,"suggestNamePrefix":"DEIsoM","repoDownloads":0,"publicationDate":["0"],"repoForks":1,"authors":["Hao Peng","Yifan Yang","Shandian Zhe","Jian Wang","Michael Gribskov","Yuan Qi"]},{"codeRepoURL":"https:\/\/github.com\/mgleeming\/Xenophile","repoDescription":"Non-targeted identification of xenobiotic-protein adducts","repoName":"Xenophile","suggestName":"Xenophile","repo":"github","description":"Metabolic bioactivation of many different chemicals results in the formation of highly reactive compounds (chemically reactive metabolites, CRMs) that can lead to toxicity via binding to macromolecular targets (e.g., proteins or DNA). There is a need to develop robust, rapid, and nontargeted analytical techniques to determine the identity of the protein targets of CRMs and their sites of modification. Here, we introduce a nontargeted methodology capable of determining both the identity of a CRM formed from an administered compound as well as the protein targets modified by the reactive metabolite in a single experiment without prior information. Acetaminophen (N-acetyl-p-aminophenol, APAP) and 13C6-APAP were incubated with rat liver microsomes, which are known to bioactivate APAP to the reactive metabolite N-acetyl-p-benzoquinone imine (NAPQI). Global tryptic digestion followed by liquid chromatographic\/mass spectrometric (LC\/MS) analysis was used to locate “twin” ion peaks of peptides adducted by NAPQI and for shotgun proteomics via tandem mass spectrometry (MS\/MS). By the development of blended data analytics software called Xenophile, the identity of the amino acid residue that was adducted can be established, which eliminates the need for specific parametrization of protein database search algorithms. This combination of experimental design and data analysis software allows the identity of a CRM, the protein target, and the amino acid residues that are modified to be rapidly established directly from experimental data. Xenophile is freely available from https:\/\/github.com\/mgleeming\/Xenophile.","language":["Python"],"publicationDOI":["10.1021\/acs.analchem.6b04604"],"publicationTitle":["Nontargeted Identification of Reactive Metabolite Protein Adducts"],"repoUpdatedDate":"2017-03-26T05:06:34Z","repoHomepage":"","institutions":["The University of Melbourne","University of New South Wales"],"linkUrls":["github.com\/mgleeming\/Xenophile"],"license":"https:\/\/github.com\/mgleeming\/Xenophile\/blob\/master\/license.txt","repoCreationDate":"2017-03-26T05:05:35Z","_version_":1582445432763580416,"name":"Xenophile","id":1,"suggestNamePrefix":"Xenophile","repoDownloads":0,"publicationDate":["0"],"repoForks":0,"authors":["Michael G. Leeming","William A. Donald","Richard A. J. O'Hair"]},{"codeRepoURL":"https:\/\/github.com\/ncbi\/sra-tools","repoDescription":"SRA Tools","repoName":"sra-tools","suggestName":"fastQ_brew","repo":"github","description":"Background: Next generation sequencing datasets are stored as FASTQ formatted files. In order to avoid downstream artefacts, it is critical to implement a robust preprocessing protocol of the FASTQ sequence in order to determine the integrity and quality of the data. Results: Here I describe fastQ_brew which is a package that provides a suite of methods to evaluate sequence data in FASTQ format and eficiently implements a variety of manipulations to filter sequence data by size, quality and\/or sequence. fastQ_brew allows for mismatch searches to adapter sequences, left and right end trimming, removal of duplicate reads, as well as reads containing non-designated bases. fastQ_brew also returns summary statistics on the unfiltered and filtered FASTQ data, and oefrs FASTQ to FASTA conversion as well as FASTQ reverse complement and DNA to RNA manipulations. Conclusions: fastQ_brew is open source and freely available to all users at the following webpage: https:\/\/github.com\/dohalloran\/fastQ_brew.","language":["Shell"],"publicationDOI":["10.1186\/s13104-017-2616-7"],"publicationTitle":["fastQ_brew: module for analysis, preprocessing, and reformatting of FASTQ sequence data"],"repoUpdatedDate":"2017-11-01T03:23:13Z","repoHomepage":"","institutions":["The George Washington University"],"linkUrls":["github.com\/ncbi\/sra-tools","github.com\/lh3\/seqtk","www.ncbi.nlm.nih.gov\/sra","github.com\/dohalloran\/fastQ_brew","github.com\/dohalloran\/fastQ_brew.Operating","perldoc.perl.org\/index-modules-A.html"],"license":"https:\/\/github.com\/ncbi\/sra-tools\/blob\/master\/LICENSE","repoCreationDate":"2014-08-21T21:25:38Z","_version_":1582909818915520512,"name":"fastQ_brew","id":3,"suggestNamePrefix":"fastQ_brew","repoDownloads":0,"publicationDate":["7\/8\/2017"],"repoForks":58},{"codeRepoURL":"https:\/\/github.com\/qunfengdong\/BLCA","repoDescription":"","repoName":"BLCA","suggestName":"BLCA","repo":"github","description":"Background: Species-level classification for 16S rRNA gene sequences remains a serious challenge for microbiome researchers, because existing taxonomic classification tools for 16S rRNA gene sequences either do not provide specieslevel classification, or their classification results are unreliable. The unreliable results are due to the limitations in the existing methods which either lack solid probabilistic-based criteria to evaluate the confidence of their taxonomic assignments, or use nucleotide k-mer frequency as the proxy for sequence similarity measurement. Results: We have developed a method that shows significantly improved species-level classification results over existing methods. Our method calculates true sequence similarity between query sequences and database hits using pairwise sequence alignment. Taxonomic classifications are assigned from the species to the phylum levels based on the lowest common ancestors of multiple database hits for each query sequence, and further classification reliabilities are evaluated by bootstrap confidence scores. The novelty of our method is that the contribution of each database hit to the taxonomic assignment of the query sequence is weighted by a Bayesian posterior probability based upon the degree of sequence similarity of the database hit to the query sequence. Our method does not need any training datasets specific for different taxonomic groups. Instead only a reference database is required for aligning to the query sequences, making our method easily applicable for different regions of the 16S rRNA gene or other phylogenetic marker genes. Conclusions: Reliable species-level classification for 16S rRNA or other phylogenetic marker genes is critical for microbiome research. Our software shows significantly higher classification accuracy than the existing tools and we provide probabilistic-based confidence scores to evaluate the reliability of our taxonomic classification assignments based on multiple database matches to query sequences. Despite its higher computational costs, our method is still suitable for analyzing large-scale microbiome datasets for practical purposes. Furthermore, our method can be applied for taxonomic classification of any phylogenetic marker gene sequences. Our software, called BLCA, is freely available at https:\/\/github.com\/qunfengdong\/BLCA.","language":["Python"],"publicationDOI":["10.1186\/s12859-017-1670-4"],"publicationTitle":["A Bayesian taxonomic classification method for 16S rRNA gene sequences with improved species-level accuracy"],"repoUpdatedDate":"2017-11-18T13:40:18Z","repoHomepage":"","institutions":["Loyola University Chicago Lake Shore Campus","Loyola University Chicago Health Sciences Division","Loyola University Chicago Water Tower Campus"],"linkUrls":["github.com\/qunfengdong\/BLCA","ftp.ncbi.nlm.nih.gov\/blast\/db\/16SMicrobial.tar.gz","ftp.ncbi.nih.gov\/pub\/taxonomy\/"],"license":"No License","repoCreationDate":"2016-10-27T20:17:03Z","_version_":1585444054508765184,"name":"BLCA","id":15,"suggestNamePrefix":"BLCA","repoDownloads":0,"publicationDate":["5\/3\/2017"],"repoForks":3,"authors":["Xiang Gao","Huaiying Lin","Kashi Revanna","Qunfeng Dong"]},{"codeRepoURL":"https:\/\/github.com\/XiongLi2016\/ESMO","repoDescription":"exhausitive search and multiple objectives","repoName":"ESMO","suggestName":"ESMO","repo":"github","description":"Motivation: The existing epistasis analysis approaches have been criticized mainly for their: (i) ignoring heterogeneity during epistasis analysis; (ii) high computational costs; and (iii) volatility of performances and results. Therefore, they will not perform well in general, leading to lack of reproducibility and low power in complex disease association studies. In this work, a fast scheme is proposed to accelerate exhaustive searching based on multi-objective optimization named ESMO for concurrently analyzing heterogeneity and epistasis phenomena. In ESMO, mutual entropy and Bayesian network approaches are combined for evaluating epistatic SNP combinations. In order to be compatible with heterogeneity of complex diseases, we designed an adaptive framework based on non-dominant sort and top k selection algorithm with improved time complexity O(k*M*N). Moreover, ESMO is accelerated by strategies such as trading space for time, calculation sharing and parallel computing. Finally, ESMO is nonparametric and model-free. Results:We compared ESMO with other recent or classic methods using different evaluating measures. The experimental results show that our method not only can quickly handle epistasis, but also can effectively detect heterogeneity of complex population structures. Availability and implementation: https:\/\/github.com\/XiongLi2016\/ESMO\/tree\/master\/ESMO-com mon-master. Contact: lx_hncs@163.com VC The Author 2017. Published by Oxford University Press. All rights reserved. For Permissions, please e-mail: journals.permissions@oup.com","language":["Matlab"],"publicationDOI":["10.1093\/bioinformatics\/btx339"],"publicationTitle":["A fast and exhaustive method for heterogeneity and epistasis analysis based on multi-objective optimization"],"repoUpdatedDate":"2017-10-13T07:09:24Z","repoHomepage":"","institutions":["East China Jiaotong University"],"linkUrls":["github.com\/XiongLi2016\/ESMO\/tree\/master\/ESMO-com"],"license":"No License","repoCreationDate":"2017-05-06T02:38:12Z","_version_":1585444111484190720,"name":"ESMO","id":17,"suggestNamePrefix":"ESMO","repoDownloads":0,"publicationDate":["0"],"repoForks":0,"authors":["Xiong Li","Associate Editor: John Hancock"]},{"codeRepoURL":"https:\/\/github.com\/vibbits\/phyd3","repoDescription":"Phylogenetic tree viewer based on D3.js","repoName":"phyd3","suggestName":"PhyD3","repo":"github","description":"Motivation: Comparative and evolutionary studies utilize phylogenetic trees to analyze and visualize biological data. Recently, several web-based tools for the display, manipulation and annotation of phylogenetic trees, such as iTOL and Evolview, have released updates to be compatible with the latest web technologies. While those web tools operate an open server access model with a multitude of registered users, a feature-rich open source solution using current web technologies is not available. Results: Here, we present an extension of the widely used PhyloXML standard with several new options to accommodate functional genomics or annotation datasets for advanced visualization. Furthermore, PhyD3 has been developed as a lightweight tool using the JavaScript library D3.js to achieve a state-of-the-art phylogenetic tree visualization in the web browser, with support for advanced annotations. The current implementation is open source, easily adaptable and easy to implement in third parties' web sites. Availability and implementation: More information about PhyD3 itself, installation procedures and implementation links are available at http:\/\/phyd3.bits.vib.be and at http:\/\/github.com\/vibbits\/phyd3\/. Contact: klaas.vandepoele@ugent.vib.be or michiel.vanbel@ugent.vib.be Supplementary information: Supplementary data are available at Bioinformatics online.","language":["JavaScript"],"publicationDOI":["10.1093\/bioinformatics\/btx324"],"publicationTitle":["PhyD3: a phylogenetic tree viewer with extended phyloXML support for functional genomics data visualization"],"repoUpdatedDate":"2017-11-17T16:33:13Z","repoHomepage":"","institutions":["Ghent University","VIB Bioinformatics Core","VIB-UGent Center for Plant Systems Biology"],"linkUrls":["github.com\/vibbits\/phyd3\/","github.com\/vibbits\/phyd3"],"license":"GNU General Public License v3.0","repoCreationDate":"2016-10-18T09:19:54Z","_version_":1585444098475556864,"name":"PhyD3","id":16,"suggestNamePrefix":"PhyD3","repoDownloads":0,"publicationDate":["0"],"repoForks":7,"authors":["Łukasz Kreft","Alexander Botzki","Frederik Coppens","Klaas Vandepoele","Michiel Van Bel"]},{"codeRepoURL":"https:\/\/github.com\/sysbiolux\/FALCON","repoDescription":"FALCON: A Toolbox for the Fast Contextualization of Logical Networks","repoName":"FALCON","suggestName":"FALCON","repo":"github","description":"Motivation: Mathematical modelling of regulatory networks allows for the discovery of knowledge at the system level. However, existing modelling tools are often computation-heavy and do not offer intuitive ways to explore the model, to test hypotheses or to interpret the results biologically. Results: We have developed a computational approach to contextualize logical models of regulatory networks with biological measurements based on a probabilistic description of rule-based interactions between the different molecules. Here, we propose a Matlab toolbox, FALCON, to automatically and efficiently build and contextualize networks, which includes a pipeline for conducting parameter analysis, knockouts and easy and fast model investigation. The contextualized models could then provide qualitative and quantitative information about the network and suggest hypotheses about biological processes. Availability and implementation: FALCON is freely available for non-commercial users on GitHub under the GPLv3 licence. The toolbox, installation instructions, full documentation and test datasets are available at https:\/\/github.com\/sysbiolux\/FALCON. FALCON runs under Matlab (MathWorks) and requires the Optimization Toolbox. Contact: thomas.sauter@uni.lu Supplementary information: Supplementary data are available at Bioinformatics online.","language":["Matlab"],"publicationDOI":["10.1093\/bioinformatics\/btx380"],"publicationTitle":["FALCON: a toolbox for the fast contextualization of logical networks"],"repoUpdatedDate":"2016-10-28T09:13:14Z","repoHomepage":"","institutions":["University of Luxembourg"],"linkUrls":["github.com\/sysbiolux\/FALCON"],"license":"GNU General Public License v3.0","repoCreationDate":"2016-09-07T05:41:18Z","_version_":1584801590144925696,"name":"FALCON","id":14,"suggestNamePrefix":"FALCON","repoDownloads":0,"publicationDate":["0"],"repoForks":0,"authors":["S e´bastien De Landtsheer","Panuwat Trairatphisan","Philippe Lucarelli","Thomas Sauter"]},{"codeRepoURL":"https:\/\/github.com\/NDBL\/ADDIT","repoDescription":"Imputation tool for missing genotype data in model and non-model species","repoName":"ADDIT","suggestName":"ADDIT","repo":"github","description":"-High-throughput sequencing techniques have generated massive quantities of genotype data. Haplotype phasing has proven to be a useful and effective method for analyzing these data. However, the quality of phasing is undermined by the presence of missing information. Imputation provides an effective means of improving the underlying genotype information. For model organisms, imputation can rely on an available reference genotype panel and a physical or genetic map. For non-model organisms, which often do not have a genotype panel, it is important to design an imputation technique that does not rely on reference data. Here, we present ADDIT (Accurate Data-Driven Imputation Technique), which is composed of two data-driven algorithms capable of handling data generated from model and non-model organisms. The non-model variant of ADDIT (referred to as ADDIT-NM) employs statistical inference methods to impute missing genotypes, whereas the model variant (referred to as ADDIT-M) leverages a supervised learning-based approach for imputation. We demonstrate that both variants of ADDIT are more accurate, faster, and require less memory than leading state-of-the-art imputation tools using model (human) and non-model (maize, apple, grape) genotype data. Software Availability: The source code of ADDIT and test data sets are available at https:\/\/github.com\/NDBL\/ADDIT","language":["Python"],"publicationDOI":["10.1109\/TCBB.2017.2708701"],"publicationTitle":["Highly Accurate and Efficient Data-Driven Methods For Genotype Imputation"],"repoUpdatedDate":"2017-04-19T07:29:27Z","repoHomepage":"","institutions":["University of Notre Dame"],"linkUrls":["github.com\/NDBL\/ADDIT","www.ieee.org\/publications_standards\/publications\/rights\/index.html"],"license":"No License","repoCreationDate":"2017-04-19T07:25:35Z","_version_":1585444150694641664,"name":"ADDIT","id":19,"suggestNamePrefix":"ADDIT","repoDownloads":0,"publicationDate":["12\/2\/2016"],"repoForks":0,"authors":["Olivia Choudhury","Student Member","Ankush Chakrabarty","Member","Scott J. Emrich","Senior Member"]},{"codeRepoURL":"https:\/\/github.com\/hail-is\/hail","repoDescription":"Scalable genomic data analysis.","repoName":"hail","suggestName":"Pheno4J","repo":"github","description":"Summary: Efficient storage and querying of large amounts of genetic and phenotypic data is crucial to contemporary clinical genetic research. This introduces computational challenges for classical relational databases, due to the sparsity and sheer volume of the data. Our Java based solution loads annotated genetic variants and well phenotyped patients into a graph database to allow fast efficient storage and querying of large volumes of structured genetic and phenotypic data. This abstracts technical problems away and lets researchers focus on the science rather than the implementation. We have also developed an accompanying webserver with end-points to facilitate querying of the database. Availability and implementation: The Java and Python code are available at https:\/\/github.com\/phe nopolis\/pheno4j. Contact: n.pontikos@ucl.ac.uk Supplementary information: Supplementary data are available at Bioinformatics online.","language":["Scala"],"publicationDOI":["10.1093\/bioinformatics\/btx397"],"publicationTitle":["Pheno4J: a gene to phenotype graph database"],"repoUpdatedDate":"2017-11-21T03:47:52Z","repoHomepage":"https:\/\/hail.is","institutions":["Computer Science Department","Globe View","University College London","Moorfields Eye Hospital","John Radcliffe Hospital"],"linkUrls":["github.com\/phe","phenopolis.github.io\/","github.com\/hail-is\/hail","github.com\/phenopolis\/pheno4j\/","github.com\/SciGraph\/SciGraph","bridgestudy.medschl.cam.ac.uk"],"license":"MIT License","repoCreationDate":"2015-10-27T20:55:42Z","_version_":1584801520598122496,"name":"Pheno4J","id":13,"suggestNamePrefix":"Pheno4J","repoDownloads":0,"publicationDate":["0"],"repoForks":85,"authors":["Sajid Mughal","Ismail Moghul","Jing Yu","UKIRDC","Tristan Clark","David S. Gregory","Nikolas Pontikos"]},{"codeRepoURL":"https:\/\/github.com\/qtltools\/qtltools","repoDescription":"A complete tool set for molecular QTL discovery and analysis","repoName":"qtltools","suggestName":"qtltools","repo":"github","description":"Population scale studies combining genetic information with molecular phenotypes (for example, gene expression) have become a standard to dissect the effects of genetic variants onto organismal phenotypes. These kinds of data sets require powerful, fast and versatile methods able to discover molecular Quantitative Trait Loci (molQTL). Here we propose such a solution, QTLtools, a modular framework that contains multiple new and well-established methods to prepare the data, to discover proximal and distal molQTLs and, finally, to integrate them with GWAS variants and functional annotations of the genome. We demonstrate its utility by performing a complete expression QTL study in a few easy-to-perform steps. QTLtools is open source and available at https:\/\/qtltools.github.io\/qtltools\/.","language":["C++"],"publicationDOI":["10.1038\/ncomms15452"],"publicationTitle":["A complete tool set for molecular QTL discovery and analysis"],"repoUpdatedDate":"2017-11-02T11:08:43Z","repoHomepage":"","linkUrls":["www.ebi.ac.uk\/arrayexpress\/experiments\/E-MTAB-3657\/","qtltools.github.io\/qtltools\/","www.nature.com\/naturecommunications","www.ebi.ac.uk\/arrayexpress\/files\/E-GEUV-1\/processed\/"],"license":"GNU General Public License v3.0","repoCreationDate":"2016-07-11T08:52:13Z","_version_":1583539099748270080,"name":"qtltools","id":12,"suggestNamePrefix":"qtltools","repoDownloads":0,"publicationDate":["0"],"repoForks":4,"authors":["Olivier Delaneau","Halit Ongen","Andrew A. Brown","Alexandre Fort","Nikolaos I. Panousis","Emmanouil T. Dermitzakis"]},{"codeRepoURL":"https:\/\/github.com\/zji90\/SCRAT","repoDescription":"","repoName":"SCRAT","suggestName":"SCRAT","repo":"github","description":"Summary: Emerging single-cell technologies (e.g. single-cell ATAC-seq, DNase-seq or ChIP-seq) have made it possible to assay regulome of individual cells. Single-cell regulome data are highly sparse and discrete. Analyzing such data is challenging. User-friendly software tools are still lacking. We present SCRAT, a Single-Cell Regulome Analysis Toolbox with a graphical user interface, for studying cell heterogeneity using single-cell regulome data. SCRAT can be used to conveniently summarize regulatory activities according to different features (e.g. gene sets, transcription factor binding motif sites, etc.). Using these features, users can identify cell subpopulations in a heterogeneous biological sample, infer cell identities of each subpopulation, and discover distinguishing features such as gene sets and transcription factors that show different activities among subpopulations. Availability and implementation: SCRAT is freely available at https:\/\/zhiji.shinyapps.io\/scrat as an online web service and at https:\/\/github.com\/zji90\/SCRAT as an R package.Contact: hji@jhu.edu Supplementary information: Supplementary data are available at Bioinformatics online.","language":["R"],"publicationDOI":["10.1093\/bioinformatics\/btx315"],"publicationTitle":["Single-cell regulome data analysis by SCRAT"],"repoUpdatedDate":"2017-08-02T01:13:34Z","repoHomepage":"","institutions":["Johns Hopkins University Bloomberg School of Public Health"],"linkUrls":["zhiji.shinyapps.io\/scrat","github.com\/zji90\/SCRAT"],"license":"No License","repoCreationDate":"2016-01-23T22:36:08Z","_version_":1583539078999048192,"name":"SCRAT","id":11,"suggestNamePrefix":"SCRAT","repoDownloads":0,"publicationDate":["0"],"repoForks":1,"authors":["Zhicheng Ji","Weiqiang Zhou","Hongkai Ji"]},{"codeRepoURL":"https:\/\/github.com\/bioinfo-ut\/GenomeTester4","repoDescription":"A toolkit for performing set operations - union, intersection and complement - on k-mer lists.","repoName":"GenomeTester4","suggestName":"FastGT","repo":"github","description":"Published: xx xx xxxx We have developed a computational method that counts the frequencies of unique k-mers in FASTQformatted genome data and uses this information to infer the genotypes of known variants. FastGT can detect the variants in a 30x genome in less than 1 hour using ordinary low-cost server hardware. The overall concordance with the genotypes of two Illumina “Platinum” genomes is 99.96%, and the concordance with the genotypes of the Illumina HumanOmniExpress is 99.82%. Our method provides k-mer database that can be used for the simultaneous genotyping of approximately 30 million single nucleotide variants (SNVs), including >23,000 SNVs fromY chromosome. The source code of FastGT software is available at GitHub (https:\/\/github.com\/bioinfo-ut\/GenomeTester4\/).","language":["C"],"publicationDOI":["10.1038\/s41598-017-02487-5"],"publicationTitle":["FastGT: an alignment-free method for calling common SNVs directly from raw sequencing reads"],"repoUpdatedDate":"2017-10-15T22:05:56Z","repoHomepage":"","linkUrls":["github.com\/bioinfo-ut\/GenomeTester4\/","www.ebi.ac.uk\/ena\/data\/view\/ERP001960"],"license":"GNU General Public License v3.0","repoCreationDate":"2015-05-19T12:13:01Z","_version_":1585444128530890752,"name":"FastGT","id":18,"suggestNamePrefix":"FastGT","repoDownloads":0,"publicationDate":["4\/12\/2017"],"repoForks":2,"authors":["Fanny-Dhelia Pajuste","Lauris Kaplinski","Märt Möls","Tarmo Puurand","Maarja Lepamets","Maido Remm"]},{"codeRepoURL":"https:\/\/github.com\/BilkentCompGen\/GateKeeper","repoDescription":"GateKeeper: Fast Alignment Filter for DNA Short Read Mapping","repoName":"GateKeeper","suggestName":"GateKeeper","repo":"github","description":"Motivation: High throughput DNA sequencing (HTS) technologies generate an excessive number of small DNA segments -called short reads- that cause significant computational burden. To analyze the entire genome, each of the billions of short reads must be mapped to a reference genome based on the similarity between a read and 'candidate' locations in that reference genome. The similarity measurement, called alignment, formulated as an approximate string matching problem, is the computational bottleneck because: (i) it is implemented using quadratic-time dynamic programming algorithms and (ii) the majority of candidate locations in the reference genome do not align with a given read due to high dissimilarity. Calculating the alignment of such incorrect candidate locations consumes an overwhelming majority of a modern read mapper's execution time. Therefore, it is crucial to develop a fast and effective filter that can detect incorrect candidate locations and eliminate them before invoking computationally costly alignment algorithms. Results: We propose GateKeeper, a new hardware accelerator that functions as a pre-alignment step that quickly filters out most incorrect candidate locations. GateKeeper is the first design to accelerate pre-alignment using Field-Programmable Gate Arrays (FPGAs), which can perform prealignment much faster than software. When implemented on a single FPGA chip, GateKeeper maintains high accuracy (on average >96%) while providing, on average, 90-fold and 130-fold speedup over the state-of-the-art software pre-alignment techniques, Adjacency Filter and Shifted Hamming Distance (SHD), respectively. The addition of GateKeeper as a pre-alignment step can reduce the verification time of the mrFAST mapper by a factor of 10. Availability and implementation: https:\/\/github.com\/BilkentCompGen\/GateKeeper Contact: mohammedalser@bilkent.edu.tr or onur.mutlu@inf.ethz.ch or calkan@cs.bilkent.edu.tr Supplementary information: Supplementary data are available at Bioinformatics online.","language":["VHDL"],"publicationDOI":["10.1093\/bioinformatics\/btx342"],"publicationTitle":["GateKeeper: a new hardware architecture for accelerating pre-alignment in DNA short read mapping"],"repoUpdatedDate":"2017-06-03T00:42:24Z","repoHomepage":"","institutions":["Bilkent University","Carnegie Mellon University","ETH Zu ̈ rich","TOBB University of Economics & Technology"],"linkUrls":["github.com\/BilkentCompGen\/GateKeeper"],"license":"GNU General Public License v3.0","repoCreationDate":"2016-03-29T22:29:38Z","_version_":1585444168061157376,"name":"GateKeeper","id":20,"suggestNamePrefix":"GateKeeper","repoDownloads":0,"publicationDate":["0"],"repoForks":1,"authors":["Mohammed Alser","Hasan Hassan","Hongyi Xin","Oguz Ergin","Onur Mutlu","Can Alkan"]},{"codeRepoURL":"https:\/\/github.com\/dvav\/eQTLseq","repoDescription":"Hierarchical probabilistic models for multiple gene\/variant associations based on NGS data","repoName":"eQTLseq","suggestName":"eQTLseq","repo":"github","description":"Motivation: The identification of genetic variants influencing gene expression (known as expression quantitative trait loci or eQTLs) is important in unravelling the genetic basis of complex traits. Detecting multiple eQTLs simultaneously in a population based on paired DNA-seq and RNA-seq assays employs two competing types of models: models which rely on appropriate transformations of RNA-seq data (and are powered by a mature mathematical theory), or count-based models, which represent digital gene expression explicitly, thus rendering such transformations unnecessary. The latter constitutes an immensely popular methodology, which is however plagued by mathematical intractability. Results: We develop tractable count-based models, which are amenable to efficient estimation through the introduction of latent variables and the appropriate application of recent statistical theory in a sparse Bayesian modelling framework. Furthermore, we examine several transformation methods for RNA-seq read counts and we introduce arcsin, logit and Laplace smoothing as preprocessing steps for transformation-based models. Using natural and carefully simulated data from the 1000 Genomes and gEUVADIS projects, we benchmark both approaches under a variety of scenarios, including the presence of noise and violation of basic model assumptions. We demonstrate that an arcsin transformation of Laplace-smoothed data is at least as good as state-of-the-art models, particularly at small samples. Furthermore, we show that an over-dispersed Poisson model is comparable to the celebrated Negative Binomial, but much easier to estimate. These results provide strong support for transformation-based versus count-based (particularly NegativeBinomial-based) models for eQTL mapping. Availability and implementation: All methods are implemented in the free software eQTLseq: https:\/\/github.com\/dvav\/eQTLseq Contact: dimitris.vavoulis@well.ox.ac.uk Supplementary information: Supplementary data are available at Bioinformatics online.","language":["Jupyter Notebook"],"publicationDOI":["10.1093\/bioinformatics\/btx355"],"publicationTitle":["Hierarchical probabilistic models for multiple gene\/variant associations based on next-generation sequencing data"],"repoUpdatedDate":"2017-10-09T10:21:21Z","repoHomepage":"","institutions":["University of Oxford","John Radcliffe Hospital","National Institute for Health Research Oxford Biomedical Research Centre","The Nuffield Division of Clinical Laboratory Sciences"],"linkUrls":["github.com\/dvav\/eQTLseq"],"license":"MIT License","repoCreationDate":"2017-02-08T14:07:34Z","_version_":1585444202050748416,"name":"eQTLseq","id":24,"suggestNamePrefix":"eQTLseq","repoDownloads":0,"publicationDate":["0"],"repoForks":2,"authors":["Dimitrios V. Vavoulis","Jenny C. Taylor","Anna Schuh"]},{"codeRepoURL":"https:\/\/github.com\/kyungtaekLIM\/PSI-BLASTexB","repoDescription":"PSI-BLAST with a new sequence weighting algorithm","repoName":"PSI-BLASTexB","suggestName":"PSI-BLASTexB","repo":"github","description":"Background: PSI-BLAST, an extremely popular tool for sequence similarity search, features the utilization of PositionSpecific Scoring Matrix (PSSM) constructed from a multiple sequence alignment (MSA). PSSM allows the detection of more distant homologs than a general amino acid substitution matrix does. An accurate estimation of the weights for sequences in an MSA is crucially important for PSSM construction. PSI-BLAST divides a given MSA into multiple blocks, for which sequence weights are calculated. When the block width becomes very narrow, the sequence weight calculation can be odd. Results: We demonstrate that PSI-BLAST indeed generates a significant fraction of blocks having width less than 5, thereby degrading the PSI-BLAST performance. We revised the code of PSI-BLAST to prevent the blocks from being narrower than a given minimum block width (MBW). We designate the modified application of PSI-BLAST as PSI-BLASTexB. When MBW is 25, PSI-BLASTexB notably outperforms PSI-BLAST consistently for three independent benchmark sets. The performance boost is even more drastic when an MSA, instead of a sequence, is used as a query. Conclusions: Our results demonstrate that the generation of narrow-width blocks during the sequence weight calculation is a critically important factor that restricts the PSI-BLAST search performance. By preventing narrow blocks, PSI-BLASTexB upgrades the PSI-BLAST performance remarkably. Binaries and source codes of PSI-BLASTexB (MBW = 25) are available at https:\/\/github.com\/kyungtaekLIM\/PSI-BLASTexB.","language":["C++"],"publicationDOI":["10.1186\/s12859-017-1686-9"],"publicationTitle":["Simple adjustment of the sequence weight algorithm remarkably enhances PSI-BLAST performance"],"repoUpdatedDate":"2016-12-09T11:18:35Z","repoHomepage":"","institutions":["National Institute of Advanced Industrial Science and Technology (AIST)"],"linkUrls":["ftp.ncbi.nlm.nih.gov\/blast\/executables\/blast+\/2.5.0\/","github.com\/kyungtaekLIM\/PSI-BLASTexB"],"license":"GNU Lesser General Public License v3.0","repoCreationDate":"2016-12-09T10:58:56Z","_version_":1585444249806045184,"name":"PSI-BLASTexB","id":26,"suggestNamePrefix":"PSI-BLASTexB","repoDownloads":0,"publicationDate":["5\/15\/2017"],"repoForks":0,"authors":["Toshiyuki Oda","Kyungtaek Lim","Kentaro Tomii"]},{"codeRepoURL":"https:\/\/github.com\/theislab\/kbranches","repoDescription":"Finding branching events and tips in single cell differentiation trajectories","repoName":"kbranches","suggestName":"kbranches","repo":"github","description":"Motivation: The identification of heterogeneities in cell populations by utilizing single-cell technologies such as single-cell RNA-Seq, enables inference of cellular development and lineage trees. Several methods have been proposed for such inference from high-dimensional single-cell data. They typically assign each cell to a branch in a differentiation trajectory. However, they commonly assume specific geometries such as tree-like developmental hierarchies and lack statistically sound methods to decide on the number of branching events. Results: We present K-Branches, a solution to the above problem by locally fitting half-lines to single-cell data, introducing a clustering algorithm similar to K-Means. These halflines are proxies for branches in the differentiation trajectory of cells. We propose a modified version of the GAP statistic for model selection, in order to decide on the number of lines that best describe the data locally. In this manner, we identify the location and number of subgroups of cells that are associated with branching events and full differentiation, respectively. We evaluate the performance of our method on single-cell RNA-Seq data describing the differentiation of myeloid progenitors during hematopoiesis, single-cell qPCR data of mouse blastocyst development, single-cell qPCR data of human myeloid monocytic leukemia and artificial data. Availability and implementation: An R implementation of K-Branches is freely available at https:\/\/github.com\/theislab\/kbranches. Contact: fabian.theis@helmholtz-muenchen.de Supplementary information: Supplementary data are available at Bioinformatics online.","language":["R"],"publicationDOI":["10.1093\/bioinformatics\/btx325"],"publicationTitle":["Model-based branching point detection in single-cell data by K-branches clustering"],"repoUpdatedDate":"2016-12-15T15:01:43Z","repoHomepage":"","institutions":["Technical University of Munich","Helmholtz Zentrum Mu ̈ nchen"],"linkUrls":["github.com\/theislab\/kbranches"],"license":"GNU General Public License v3.0","repoCreationDate":"2016-11-16T17:01:48Z","_version_":1585444277805121536,"name":"kbranches","id":28,"suggestNamePrefix":"kbranches","repoDownloads":0,"publicationDate":["0"],"repoForks":0,"authors":["Nikolaos K. Chlis","F. Alexander Wolf","Fabian J. Theis"]},{"codeRepoURL":"https:\/\/github.com\/dongfanghong\/deepboost","repoDescription":"","repoName":"deepboost","suggestName":"deepboost","repo":"github","description":"Characterizing the binding behaviors of RNA-binding proteins (RBPs) is important for understanding their functional roles in gene expression regulation. However, current high-throughput experimental methods for identifying RBP targets, such as CLIP-seq and RNAcompete, usually suffer from the false negative issue. Here, we develop a deep boosting based machine learning approach, called DeBooster, to accurately model the binding sequence preferences and identify the corresponding binding targets of RBPs from CLIP-seq data. Comprehensive validation tests have shown that DeBooster can outperform other state-of-the-art approaches in RBP target prediction. In addition, we have demonstrated that DeBooster may provide new insights into understanding the regulatory functions of RBPs, including the binding effects of the RNA helicase MOV10 on mRNA degradation, the potentially different ADAR1 binding behaviors related to its editing activity, as well as the antagonizing effect of RBP binding on miRNA repression. Moreover, DeBooster may provide an effective index to investigate the effect of pathogenic mutations in RBP binding sites, especially those related to splicing events. We expect that DeBooster will be widely applied to analyze large-scale CLIPseq experimental data and can provide a practically useful tool for novel biological discoveries in understanding the regulatory mechanisms of RBPs. The source code of DeBooster can be downloaded from http:\/\/github.com\/dongfanghong\/deepboost.","language":["Python"],"publicationDOI":["10.1093\/nar\/gkx492"],"publicationTitle":["A deep boosting based approach for capturing the sequence binding preferences of RNA-binding proteins from high-throughput CLIP-seq data"],"repoUpdatedDate":"2017-10-08T07:03:32Z","repoHomepage":"","institutions":["University of California","Tsinghua University","Carnegie Mellon University"],"linkUrls":["github.com\/dongfanghong\/deepboost"],"license":"No License","repoCreationDate":"2016-10-19T09:37:05Z","_version_":1585444225611202560,"name":"deepboost","id":25,"suggestNamePrefix":"deepboost","repoDownloads":0,"publicationDate":["5\/23\/2017"],"repoForks":4,"authors":["Shuya Li","Fanghong Dong","Yuexin Wu","Sai Zhang","Chen Zhang","Xiao Liu","Tao Jiang","Jianyang Zeng"]},{"codeRepoURL":"https:\/\/github.com\/jpsglouzon\/Structurexplor","repoDescription":"An interactive plateform to explore structural features of RNA secondary structures","repoName":"structurexplor","suggestName":"Structurexplor","repo":"github","description":"Summary: Discovering function-related structural features, such as the cloverleaf shape of transfer RNA secondary structures, is essential to understand RNA function. With this aim, we have developed a platform, named Structurexplor, to facilitate the exploration of structural features in populations of RNA secondary structures. It has been designed and developed to help biologists interactively search for, evaluate and select interesting structural features that can potentially explain RNA functions. Availability and implementation: Structurxplor is a web application available at http:\/\/structurex plor.dinf.usherbrooke.ca. The source code can be found at http:\/\/jpsglouzon.github.io\/structurex plor\/. Contact: shengrui.wang@usherbrooke.ca Supplementary information: Supplementary data are available at Bioinformatics online.","language":["JavaScript"],"publicationDOI":["10.1093\/bioinformatics\/btx323"],"publicationTitle":["Structurexplor: a platform for the exploration of structural features of RNA secondary structures"],"repoUpdatedDate":"2016-12-23T03:26:53Z","repoHomepage":"http:\/\/structurexplor.dinf.usherbrooke.ca","institutions":["Universite ́ de Sherbrooke"],"linkUrls":["jpsglouzon.github.io\/structurex"],"license":"GNU General Public License v3.0","repoCreationDate":"2016-09-08T15:21:00Z","_version_":1585444190431477760,"name":"Structurexplor","id":23,"suggestNamePrefix":"Structurexplor","repoDownloads":0,"publicationDate":["0"],"repoForks":0,"authors":["Jean-Pierre Se´ hi Glouzon","Jean-Pierre Perreault","Shengrui Wang"]},{"codeRepoURL":"https:\/\/github.com\/bernatgel\/karyoploteR","repoDescription":"karyoploteR - An R\/Bioconductor package to plot arbitrary data along the genome","repoName":"karyoploteR","suggestName":"karyoploteR","repo":"github","description":"Motivation: Data visualization is a crucial tool for data exploration, analysis and interpretation. For the visualization of genomic data there lacks a tool to create customizable non-circular plots of whole genomes from any species. Results: We have developed karyoploteR, an R\/Bioconductor package to create linear chromosomal representations of any genome with genomic annotations and experimental data plotted along them. Plot creation process is inspired in R base graphics, with a main function creating karyoplots with no data and multiple additional functions, including custom functions written by the end-user, adding data and other graphical elements. This approach allows the creation of highly customizable plots from arbitrary data with complete freedom on data positioning and representation. Availability and implementation: karyoploteR is released under Artistic-2.0 License. Source code and documentation are freely available through Bioconductor (http:\/\/www.bioconductor.org\/pack ages\/karyoploteR) and at the examples and tutorial page at https:\/\/bernatgel.github.io\/karyoploter_ tutorial. Contact: bgel@igtp.cat","language":["R"],"publicationDOI":["10.1093\/bioinformatics\/btx346"],"publicationTitle":["karyoploteR: an R\/Bioconductor package to plot customizable genomes displaying arbitrary data"],"repoUpdatedDate":"2017-11-29T10:46:37Z","repoHomepage":"","institutions":["Program for Predictive and Personalized Medicine of Cancer - Germans Trias i Pujol Research Institute (PMPPC-IGTP)"],"linkUrls":["bernatgel.github.io\/karyoploter_","bernatgel.github.io\/karyoploter_tutorial"],"license":"No License","repoCreationDate":"2016-06-07T16:32:27Z","_version_":1585444181320400896,"name":"karyoploteR","id":22,"suggestNamePrefix":"karyoploteR","repoDownloads":0,"publicationDate":["0"],"repoForks":2,"authors":["Bernat Gel","Eduard Serra"]},{"codeRepoURL":"https:\/\/github.com\/RUBi-ZA\/MD-TASK","repoDescription":"Tool suite for analysing molecular dynamics trajectories using network analysis and PRS","repoName":"MD-TASK","suggestName":"MD-TASK","repo":"github","description":"Summary: Molecular dynamics (MD) determines the physical motions of atoms of a biological macromolecule in a cell-like environment and is an important method in structural bioinformatics. Traditionally, measurements such as root mean square deviation, root mean square fluctuation, radius of gyration, and various energy measures have been used to analyze MD simulations. Here, we present MD-TASK, a novel software suite that employs graph theory techniques, perturbation response scanning, and dynamic cross-correlation to provide unique ways for analyzing MD trajectories. Availability and implementation: MD-TASK has been open-sourced and is available for download from https:\/\/github.com\/RUBi-ZA\/MD-TASK, implemented in Python and supported on Linux\/Unix.Contact: o.tastanbishop@ru.ac.za","language":["Python"],"publicationDOI":["10.1093\/bioinformatics\/btx349"],"publicationTitle":["MD-TASK: a software suite for analyzing molecular dynamics trajectories"],"repoUpdatedDate":"2016-11-29T17:45:24Z","repoHomepage":"","institutions":["Sabanci University","Rhodes University"],"linkUrls":["github.com\/RUBi-ZA\/MD-TASK,"],"license":"GNU General Public License v3.0","repoCreationDate":"2016-11-15T08:29:38Z","_version_":1585444175089762304,"name":"MD-TASK","id":21,"suggestNamePrefix":"MD-TASK","repoDownloads":0,"publicationDate":["0"],"repoForks":3,"authors":["David K. Brown","David L. Penkler","Olivier Sheik Amamuddy","Caroline Ross","Ali Rana Atilgan","Canan Atilgan","O€ zlem Tastan Bishop"]},{"codeRepoURL":"https:\/\/github.com\/pachterlab\/sleuth","repoDescription":"Differential analysis of RNA-Seq","repoName":"sleuth","suggestName":"pachterlab","repo":"github","description":"We describe sleuth (http:\/\/pachterlab.github.io\/sleuth), a method for the differential analysis of gene expression data that utilizes bootstrapping in conjunction with response error linear modeling to decouple biological variance from inferential variance. sleuth is implemented in an interactive shiny app that utilizes kallisto quanticfiations and bootstraps for fast and accurate analysis of data from rna -seq experiments.","language":["R"],"publicationDOI":["10.1038\/nmeth.4324"],"publicationTitle":["d ifferential analysis of rna -seq incorporating quanticfiation uncertainty"],"repoUpdatedDate":"2017-11-07T02:10:53Z","repoHomepage":"http:\/\/pachterlab.github.io\/sleuth","institutions":["Berkeley","Division of Biology and Biological Engineering","University of Iceland"],"linkUrls":["pachterlab.github.io\/sleuth","github.com\/pachterlab\/sleuth_paper_analysis","www.nature.com\/reprints\/index.html"],"license":"GNU General Public License v3.0","repoCreationDate":"2015-02-13T18:44:52Z","_version_":1585444261279563776,"name":"pachterlab","id":27,"suggestNamePrefix":"pachterlab","repoDownloads":0,"publicationDate":["0"],"repoForks":46,"authors":["Harold Pimentel","Nicolas L Bray","Suzette Puente","Páll Melsted","Lior Pachter"]},{"codeRepoURL":"https:\/\/github.com\/ding-lab\/BreakPointSurveyor","repoDescription":"A comprehensive pipeline to analyze and visualize structural variants","repoName":"BreakPointSurveyor","suggestName":"BreakPoint Surveyor","repo":"github","description":"Summary: BreakPoint Surveyor (BPS) is a computational pipeline for the discovery, characterization, and visualization of complex genomic rearrangements, such as viral genome integration, in paired-end sequence data. BPS facilitates interpretation of structural variants by merging structural variant breakpoint predictions, gene exon structure, read depth, and RNA-sequencing expression into a single comprehensive figure. Availability and implementation: Source code and sample data freely available for download at https:\/\/github.com\/ding-lab\/BreakPointSurveyor, distributed under the GNU GPLv3 license, implemented in R, Python and BASH scripts, and supported on Unix\/Linux\/OS X operating systems. Contact: lding@wustl.edu Supplementary information: Supplementary data are available at Bioinformatics online.","language":["Shell"],"publicationDOI":["10.1093\/bioinformatics\/btx362"],"publicationTitle":["BreakPoint Surveyor: a pipeline for structural variant visualization"],"repoUpdatedDate":"2017-10-31T11:20:58Z","repoHomepage":"","institutions":["University of Texas MD Anderson Cancer Center","Department of Genetics","Department of Mathematics","Department of Pediatrics","McDonnell Genome Institute","Department of Medicine","Washington University School of Medicine"],"linkUrls":["github.com\/ding-lab\/BreakPointSurveyor,"],"license":"GNU General Public License v3.0","repoCreationDate":"2017-02-06T17:45:14Z","_version_":1585444312155422720,"name":"BreakPoint Surveyor","id":32,"suggestNamePrefix":"BreakPoint Surveyor","repoDownloads":0,"publicationDate":["0"],"repoForks":2,"authors":["Matthew A. Wyczalkowski","Kristine M. Wylie","Song Cao","Michael D. McLellan","Jennifer Flynn","Mo Huang","Kai Ye","Xian Fan","l C. W","Li Ding"]},{"codeRepoURL":"https:\/\/github.com\/broadinstitute\/picard","repoDescription":"A set of command line tools (in Java) for manipulating high-throughput sequencing (HTS) data and formats such as SAM\/BAM\/CRAM and VCF.","repoName":"picard","suggestName":"lncRNA-screen","repo":"github","description":"Background: Long non-coding RNAs (lncRNAs) have emerged as a class of factors that are important for regulating development and cancer. Computational prediction of lncRNAs from ultra-deep RNA sequencing has been successful in identifying candidate lncRNAs. However, the complexity of handling and integrating different types of genomics data poses significant challenges to experimental laboratories that lack extensive genomics expertise. Result: To address this issue, we have developed lncRNA-screen, a comprehensive pipeline for computationally screening putative lncRNA transcripts over large multimodal datasets. The main objective of this work is to facilitate the computational discovery of lncRNA candidates to be further examined by functional experiments. lncRNAscreen provides a fully automated easy-to-run pipeline which performs data download, RNA-seq alignment, assembly, quality assessment, transcript filtration, novel lncRNA identification, coding potential estimation, expression level quantification, histone mark enrichment profile integration, differential expression analysis, annotation with other type of segmented data (CNVs, SNPs, Hi-C, etc.) and visualization. Importantly, lncRNA-screen generates an interactive report summarizing all interesting lncRNA features including genome browser snapshots and lncRNA-mRNA interactions based on Hi-C data. Conclusion: lncRNA-screen provides a comprehensive solution for lncRNA discovery and an intuitive interactive report for identifying promising lncRNA candidates. lncRNA-screen is available as open-source software on GitHub.","language":["Java"],"publicationDOI":["10.1186\/s12864-017-3817-0"],"publicationTitle":["lncRNA-screen: an interactive platform for computationally screening long non-coding RNAs in large genomics datasets"],"repoUpdatedDate":"2017-11-28T18:15:03Z","repoHomepage":"http:\/\/broadinstitute.github.io\/picard\/","institutions":["New York University School of Medicine","University of Miami","Inc."],"linkUrls":["broadinstitute.github.io\/picard","github.com\/NYU-BFX\/lnc","github.com\/NYU-BFX\/lncRNA-screen\/releases\/tag\/v.02.Operating","cole-trapnell-lab.github.io","github.com\/NYU-BFX\/lncRNA-screen.Detailed","github.com\/NYU-BFX\/lncRNA-screen.Archived","github.com\/NYU-BFX\/RNA-Seq_Standard","egg2.wustl.edu\/roadmap\/web_portal"],"license":"MIT License","repoCreationDate":"2014-03-28T20:43:35Z","_version_":1585444369483169792,"name":"lncRNA-screen","id":35,"suggestNamePrefix":"lncRNA-screen","repoDownloads":0,"publicationDate":["5\/24\/2017"],"repoForks":219,"authors":["Yixiao Gong","Hsuan-Ting Huang","Yu Liang","Thomas Trimarchi","Iannis Aifantis","Aristotelis Tsirigos"]},{"codeRepoURL":"https:\/\/github.com\/bgruening\/galaxy-rna-workbench","repoDescription":"Galaxy RNA workbench","repoName":"galaxy-rna-workbench","suggestName":"The RNA workbench","repo":"github","description":"","language":["HTML"],"publicationDOI":["10.1093\/nar\/gkx409"],"publicationTitle":["The RNA workbench: best practices for RNA and high-throughput sequencing bioinformatics in Galaxy"],"repoUpdatedDate":"2017-10-26T20:32:40Z","repoHomepage":"http:\/\/bgruening.github.io\/galaxy-rna-workbench\/","institutions":["University of Freiburg","Max-Delbr u ̈ck Center for Molecular Medicine","University of Leipzig","University of Rostock","Erasmus University Medical Center","Humboldt University","University of Vienna","Max Planck Institute for Mathematics in the Sciences","Santa Fe Institute"],"linkUrls":["bgruening.github.io\/galaxyrna-workbench\/","galaxyproject.github.io\/trainingmaterial","toolshed.g2.bx.psu.edu","bioconda.github.io","github.com\/bgruening\/galaxy-rna-workbench","bgruening.github.io\/docker-galaxy-stable\/"],"license":"MIT License","repoCreationDate":"2015-01-28T12:18:39Z","_version_":1585444341168472064,"name":"The RNA workbench","id":34,"suggestNamePrefix":"The RNA workbench","repoDownloads":0,"publicationDate":["5\/31\/2017"],"repoForks":17,"authors":["Bjo¨ rn A. Gru¨ ning","Jo¨ rg Fallmann","Dilmurat Yusuf","Sebastian Will","Anika Erxleben","Florian Eggenhofer","Torsten Houwaart","B e´r e´nice Batut","Pavankumar Videm","Andrea Bagnacani","Markus Wolfien","Steffen C. Lott","Youri Hoogstrate","Wolfgang R. Hess","Olaf Wolkenhauer","Steve Hoffmann","Altuna Akalin","Uwe Ohler","Peter","F. St"]},{"codeRepoURL":"https:\/\/github.com\/jijiadong\/JDINAC","repoDescription":"Joint density-based Differential Interaction Network Analysis and Classification","repoName":"JDINAC","suggestName":"JDINAC","repo":"github","description":"Motivation: A complex disease is usually driven by a number of genes interwoven into networks, rather than a single gene product. Network comparison or differential network analysis has become an important means of revealing the underlying mechanism of pathogenesis and identifying clinical biomarkers for disease classification. Most studies, however, are limited to network correlations that mainly capture the linear relationship among genes, or rely on the assumption of a parametric probability distribution of gene measurements. They are restrictive in real application. Results: We propose a new Joint density based non-parametric Differential Interaction Network Analysis and Classification (JDINAC) method to identify differential interaction patterns of network activation between two groups. At the same time, JDINAC uses the network biomarkers to build a classification model. The novelty of JDINAC lies in its potential to capture non-linear relations between molecular interactions using high-dimensional sparse data as well as to adjust confounding factors, without the need of the assumption of a parametric probability distribution of gene measurements. Simulation studies demonstrate that JDINAC provides more accurate differential network estimation and lower classification error than that achieved by other state-of-the-art methods. We apply JDINAC to a Breast Invasive Carcinoma dataset, which includes 114 patients who have both tumor and matched normal samples. The hub genes and differential interaction patterns identified were consistent with existing experimental studies. Furthermore, JDINAC discriminated the tumor and normal sample with high accuracy by virtue of the identified biomarkers. JDINAC provides a general framework for feature selection and classification using high-dimensional sparse omics data. Availability and implementation: R scripts available at https:\/\/github.com\/jijiadong\/JDINAC Contact: lxie@iscb.org Supplementary information: Supplementary data are available at Bioinformatics online.","language":["R"],"publicationDOI":["10.1093\/bioinformatics\/btx360"],"publicationTitle":["JDINAC: joint density-based non-parametric differential interaction network analysis and classification using high-dimensional sparse omics data"],"repoUpdatedDate":"2017-09-05T02:42:10Z","repoHomepage":"","institutions":["Shandong University","The City University of New York","Shandong University of Finance and Economics","Columbia University"],"linkUrls":["github.com\/jijiadong\/JDINAC"],"license":"No License","repoCreationDate":"2017-07-23T03:17:00Z","_version_":1585444306968117248,"name":"JDINAC","id":31,"suggestNamePrefix":"JDINAC","repoDownloads":0,"publicationDate":["0"],"repoForks":1,"authors":["Jiadong Ji","Di He","Yang Feng","Yong He","Fuzhong Xue"]},{"codeRepoURL":"https:\/\/github.com\/Thakar-Lab\/FIGS","repoDescription":"Fuzzy Inference of Gene-Sets (FIGS) ","repoName":"FIGS","suggestName":"FIGS","repo":"github","description":"Background: Despite advances in the gene-set enrichment analysis methods; inadequate definitions of gene-sets cause a major limitation in the discovery of novel biological processes from the transcriptomic datasets. Typically, gene-sets are obtained from publicly available pathway databases, which contain generalized definitions frequently derived by manual curation. Recently unsupervised clustering algorithms have been proposed to identify gene-sets from transcriptomics datasets deposited in public domain. These data-driven definitions of the gene-sets can be context-specific revealing novel biological mechanisms. However, the previously proposed algorithms for identification of data-driven gene-sets are based on hard clustering which do not allow overlap across clusters, a characteristic that is predominantly observed across biological pathways. Results: We developed a pipeline using fuzzy-C-means (FCM) soft clustering approach to identify gene-sets which recapitulates topological characteristics of biological pathways. Specifically, we apply our pipeline to derive genesets from transcriptomic data measuring response of monocyte derived dendritic cells and A549 epithelial cells to influenza infections. Our approach apply Ward's method for the selection of initial conditions, optimize parameters of FCM algorithm for human cell-specific transcriptomic data and identify robust gene-sets along with versatile viral responsive genes. Conclusion: We validate our gene-sets and demonstrate that by identifying genes associated with multiple genesets, FCM clustering algorithm significantly improves interpretation of transcriptomic data facilitating investigation of novel biological processes by leveraging on transcriptomic data available in the public domain. We develop an interactive 'Fuzzy Inference of Gene-sets (FIGS)' package (GitHub: https:\/\/github.com\/Thakar-Lab\/FIGS) to facilitate use of of pipeline. Future extension of FIGS across different immune cell-types will improve mechanistic investigation followed by high-throughput omics studies.","language":["Matlab"],"publicationDOI":["10.1186\/s12859-017-1669-x"],"publicationTitle":["Meta-analysis of cell- specific transcriptomic data using fuzzy c-means clustering discovers versatile viral responsive genes"],"repoUpdatedDate":"2017-03-21T16:14:22Z","repoHomepage":"","institutions":["601 Elmwood Avenue","University of Rochester"],"linkUrls":["github.com\/ThakarLab\/FIGS","github.com\/Thakar-Lab\/FIGS","github.com\/Thakar-Lab\/FIGS-Influenza.In"],"license":"MIT License","repoCreationDate":"2017-03-21T13:56:08Z","_version_":1585444390594150400,"name":"FIGS","id":36,"suggestNamePrefix":"FIGS","repoDownloads":0,"publicationDate":["5\/3\/2017"],"repoForks":1,"authors":["Atif Khan","Dejan Katanic","Juilee Thakar"]},{"codeRepoURL":"https:\/\/github.com\/woolfson-group\/ISAMBARD","repoDescription":"Intelligent System for Analysis, Model Building And Rational Design.","repoName":"isambard","suggestName":"ISAMBARD","repo":"github","description":"Motivation: The rational design of biomolecules is becoming a reality. However, further computational tools are needed to facilitate and accelerate this, and to make it accessible to more users. Results: Here we introduce ISAMBARD, a tool for structural analysis, model building and rational design of biomolecules. ISAMBARD is open-source, modular, computationally scalable and intuitive to use. These features allow non-experts to explore biomolecular design in silico. ISAMBARD addresses a standing issue in protein design, namely, how to introduce backbone variability in a controlled manner. This is achieved through the generalization of tools for parametric modelling, describing the overall shape of proteins geometrically, and without input from experimentally determined structures. This will allow backbone conformations for entire folds and assemblies not observed in nature to be generated de novo, that is, to access the 'dark matter of protein-fold space'. We anticipate that ISAMBARD will find broad applications in biomolecular design, biotechnology and synthetic biology. Availability and implementation: A current stable build can be downloaded from the python package index (https:\/\/pypi.python.org\/pypi\/isambard\/) with development builds available on GitHub (https:\/\/github.com\/woolfson-group\/) along with documentation, tutorial material and all the scripts used to generate the data described in this paper. Contact: d.n.woolfson@bristol.ac.uk or chris.wood@bristol.ac.uk Supplementary information: Supplementary data are available at Bioinformatics online.","language":["Python"],"publicationDOI":["10.1093\/bioinformatics\/btx352"],"publicationTitle":["ISAMBARD: an open-source computational environment for biomolecular analysis, modelling and design"],"repoUpdatedDate":"2017-10-14T04:48:53Z","repoHomepage":"","institutions":["University of Bristol","University of Glasgow"],"linkUrls":["github.com\/woolfson-group\/","pypi.python.org\/pypi\/isambard\/"],"license":"MIT License","repoCreationDate":"2016-08-10T10:37:06Z","_version_":1585444326456950784,"name":"ISAMBARD","id":33,"suggestNamePrefix":"ISAMBARD","repoDownloads":0,"publicationDate":["0"],"repoForks":2,"authors":["Christopher W. Wood","Jack W. Heal","Andrew R. Thomson","Gail J. Bartlett","Amaurys A. Ibarra","R. Leo Brady","Richard B. Sessions","Derek N. Woolfson"]},{"codeRepoURL":"https:\/\/github.com\/citiususc\/pastaspark","repoDescription":"PASTASpark is an extension to PASTA (Practical Alignments using SATé and TrAnsitivity) that allows to execute it on a distributed memory cluster making use of Apache Spark.","repoName":"pastaspark","suggestName":"PASTASpark","repo":"github","description":"Motivation: One basic step in many bioinformatics analyses is the multiple sequence alignment. One of the state-of-the-art tools to perform multiple sequence alignment is PASTA (Practical Alignments using SATe´ and TrAnsitivity). PASTA supports multithreading but it is limited to process datasets on shared memory systems. In this work we introduce PASTASpark, a tool that uses the Big Data engine Apache Spark to boost the performance of the alignment phase of PASTA, which is the most expensive task in terms of time consumption. Results: Speedups up to 10 with respect to single-threaded PASTA were observed, which allows to process an ultra-large dataset of 200 000 sequences within the 24-h limit. Availability and implementation: PASTASpark is an Open Source tool available at https:\/\/github.com\/citiususc\/pastaspark Contact: josemanuel.abuin@usc.es Supplementary information: Supplementary data are available at Bioinformatics online.","language":["Python"],"publicationDOI":["10.1093\/bioinformatics\/btx354"],"publicationTitle":["PASTASpark: multiple sequence alignment meets Big Data"],"repoUpdatedDate":"2017-11-29T17:07:03Z","repoHomepage":"","institutions":["Universidade de Santiago de Compostela"],"linkUrls":["github.com\/citiususc\/pastaspark"],"license":"GNU General Public License v3.0","repoCreationDate":"2017-02-15T13:15:10Z","_version_":1585444284182560768,"name":"PASTASpark","id":29,"suggestNamePrefix":"PASTASpark","repoDownloads":0,"publicationDate":["0"],"repoForks":3,"authors":["Jos e´ M. Abuın","Tomas F. Pena","Juan C. Pichel"]},{"codeRepoURL":"https:\/\/github.com\/CompSynBioLab-KoreaUniv\/FunGAP","repoDescription":"FunGAP: fungal Genome Annotation Pipeline","repoName":"FunGAP","suggestName":"FunGAP","repo":"github","description":"Motivation: Successful genome analysis depends on the quality of gene prediction. Although fungal genome sequencing and assembly have become trivial, its annotation procedure has not been standardized yet. Results: FunGAP predicts protein-coding genes in a fungal genome assembly. To attain highquality gene models, this program runs multiple gene predictors, evaluates all predicted genes, and assembles gene models that are highly supported by homology to known sequences. To do this, we built a scoring function to estimate the congruency of each gene model based on known protein or domain homology. Availability and implementation: FunGAP is written in Python script and is available in GitHub (https:\/\/github.com\/CompSynBioLab-KoreaUniv\/FunGAP). This software is freely available only for noncommercial users. Contact: igchoi@korea.ac.kr Supplementary information: Supplementary data are available at Bioinformatics online.","language":["Python"],"publicationDOI":["10.1093\/bioinformatics\/btx353"],"publicationTitle":["FunGAP: Fungal Genome Annotation Pipeline using evidence-based gene model evaluation"],"repoUpdatedDate":"2017-11-23T02:30:49Z","repoHomepage":"","institutions":["Korea University","Berkeley","US Department of Energy Joint Genome Institute"],"linkUrls":["github.com\/CompSynBioLab-KoreaUniv\/FunGAP"],"license":"No License","repoCreationDate":"2016-12-06T10:06:02Z","_version_":1585444291489038336,"name":"FunGAP","id":30,"suggestNamePrefix":"FunGAP","repoDownloads":0,"publicationDate":["0"],"repoForks":4,"authors":["Byoungnam Min","Igor V. Grigoriev","In-Geol Choi"]},{"codeRepoURL":"https:\/\/github.com\/insilichem\/gaudi","repoDescription":"GaudiMM: A modular optimization platform for molecular design","repoName":"gaudi","suggestName":"GaudiMM","repo":"github","description":"GaudiMM (for Genetic Algorithms with Unrestricted Descriptors for Intuitive Molecular Modeling) is here presented as a modular platform for rapid 3D sketching of molecular systems. It combines a Multi-Objective Genetic Algorithm with diverse molecular descriptors to overcome the difficulty of generating candidate models for systems with scarce structural data. Its grounds consist in transforming any molecular descriptor (i.e. those generally used for analysis of data) as a guiding objective for PES explorations. The platform is written in Python with flexibility in mind: the user can choose which descriptors","language":["Python"],"publicationDOI":["10.1002\/jcc.24847"],"publicationTitle":["GaudiMM: A Modular Multi-Objective Platform for Molecular Modeling"],"repoUpdatedDate":"2017-11-10T13:33:46Z","repoHomepage":"http:\/\/gaudi.readthedocs.io","linkUrls":["github.com\/insilichem\/gaudi"],"license":"Other","repoCreationDate":"2017-04-18T13:26:42Z","_version_":1585444444107177984,"name":"GaudiMM","id":37,"suggestNamePrefix":"GaudiMM","repoDownloads":0,"publicationDate":["5\/10\/2017"],"repoForks":1},{"codeRepoURL":"https:\/\/github.com\/wyguo\/RLowPC","repoDescription":"R function to construct Relevance Low order Partial Correlation gene networks","repoName":"RLowPC","suggestName":"RLowPC","repo":"github","description":"Background: Co-expression has been widely used to identify novel regulatory relationships using high throughput measurements, such as microarray and RNA-seq data. Evaluation studies on co-expression network analysis methods mostly focus on networks of small or medium size of up to a few hundred nodes. For large networks, simulated expression data usually consist of hundreds or thousands of profiles with different perturbations or knock-outs, which is uncommon in real experiments due to their cost and the amount of work required. Thus, the performances of co-expression network analysis methods on large co-expression networks consisting of a few thousand nodes, with only a small number of profiles with a single perturbation, which more accurately reflect normal experimental conditions, are generally uncharacterized and unknown. Methods: We proposed a novel network inference methods based on Relevance Low order Partial Correlation (RLowPC). RLowPC method uses a two-step approach to select on the high-confidence edges first by reducing the search space by only picking the top ranked genes from an intial partial correlation analysis and, then computes the partial correlations in the confined search space by only removing the linear dependencies from the shared neighbours, largely ignoring the genes showing lower association. Results: We selected six co-expression-based methods with good performance in evaluation studies from the literature: Partial correlation, PCIT, ARACNE, MRNET, MRNETB and CLR. The evaluation of these methods was carried out on simulated time-series data with various network sizes ranging from 100 to 3000 nodes. Simulation results show low precision and recall for all of the above methods for large networks with a small number of expression profiles. We improved the inference significantly by refinement of the top weighted edges in the pre-inferred partial correlation networks using RLowPC. We found improved performance by partitioning large networks into smaller co-expressed modules when assessing the method performance within these modules. Conclusions: The evaluation results show that current methods suffer from low precision and recall for large co-expression networks where only a small number of profiles are available. The proposed RLowPC method effectively reduces the indirect edges predicted as regulatory relationships and increases the precision of top ranked predictions. Partitioning large networks into smaller highly co-expressed modules also helps to improve the performance of network inference methods. The RLowPC R package for network construction, refinement and evaluation is available at GitHub: https:\/\/github.com\/wyguo\/RLowPC.","language":["R"],"publicationDOI":["10.1186\/s12918-017-0440-2"],"publicationTitle":["Evaluation and improvement of the regulatory inference for large co-expression networks with limited sample size"],"repoUpdatedDate":"2017-10-16T10:38:37Z","repoHomepage":"","institutions":["Invergowrie","University of Dundee"],"linkUrls":["github.com\/wyguo\/RLowPC"],"license":"GNU General Public License v3.0","repoCreationDate":"2016-06-08T20:44:55Z","_version_":1585444604520431616,"name":"RLowPC","id":45,"suggestNamePrefix":"RLowPC","repoDownloads":0,"publicationDate":["6\/9\/2017"],"repoForks":2,"authors":["Wenbin Guo","Cristiane P. G. Calixto","Nikoleta Tzioutziou","Ping Lin","Robbie Waugh","John W. S. Brown","Runxuan Zhang"]},{"codeRepoURL":"https:\/\/github.com\/TheJacksonLaboratory\/CloudNeo","repoDescription":"CWL implementation of CloudNeo: A cloud pipeline for identifying patient-specific tumor neoantigens ","repoName":"CloudNeo","suggestName":"CloudNeo","repo":"github","description":"Summary: We present CloudNeo, a cloud-based computational workflow for identifying patientspecific tumor neoantigens from next generation sequencing data. Tumor-specific mutant peptides can be detected by the immune system through their interactions with the human leukocyte antigen complex, and neoantigen presence has recently been shown to correlate with anti T-cell immunity and efficacy of checkpoint inhibitor therapy. However computing capabilities to identify neoantigens from genomic sequencing data are a limiting factor for understanding their role. This challenge has grown as cancer datasets become increasingly abundant, making them cumbersome to store and analyze on local servers. Our cloud-based pipeline provides scalable computation capabilities for neoantigen identification while eliminating the need to invest in local infrastructure for data transfer, storage or compute. The pipeline is a Common Workflow Language (CWL) implementation of human leukocyte antigen (HLA) typing using Polysolver or HLAminer combined with custom scripts for mutant peptide identification and NetMHCpan for neoantigen prediction. We have demonstrated the efficacy of these pipelines on Amazon cloud instances through the Seven Bridges Genomics implementation of the NCI Cancer Genomics Cloud, which provides graphical interfaces for running and editing, infrastructure for workflow sharing and version tracking, and access to TCGA data. Availability and implementation: The CWL implementation is at: https:\/\/github.com\/TheJacksonLaboratory\/CloudNeo. For users who have obtained licenses for all internal software, integrated versions in CWL and on the Seven Bridges Cancer Genomics Cloud platform (https:\/\/cgc.sbgenomics.com\/, recommended version) can be obtained by contacting the authors. Contact: jeff.chuang@jax.org Supplementary information: Supplementary data are available at Bioinformatics online.","language":["HTML"],"publicationDOI":["10.1093\/bioinformatics\/btx375"],"publicationTitle":["CloudNeo: a cloud pipeline for identifying patient-specific tumor neoantigens"],"repoUpdatedDate":"2017-10-13T06:30:41Z","repoHomepage":"","institutions":["University of Connecticut Health","The Jackson Laboratory for Genomic Medicine","The Jackson Laboratory"],"linkUrls":["github.com\/TheJacksonLaboratory\/CloudNeo"],"license":"Apache License 2.0","repoCreationDate":"2016-11-14T02:15:17Z","_version_":1585444454297239552,"name":"CloudNeo","id":38,"suggestNamePrefix":"CloudNeo","repoDownloads":0,"publicationDate":["0"],"repoForks":3,"authors":["Preeti Bais","Sandeep Namburi","Daniel M. Gatti","Xinyu Zhang","Jeffrey H. Chuang"]},{"codeRepoURL":"https:\/\/github.com\/namshik\/tigeri","repoDescription":"TIGERi: T FA I llustrator for G lobal E xplanation of R egulatory i nteractions","repoName":"tigeri","suggestName":"TIGERi","repo":"github","description":"Background: Transcription factor (TF) networks play a key role in controlling the transfer of genetic information from gene to mRNA. Much progress has been made on understanding and reverse-engineering TF network topologies using a range of experimental and theoretical methodologies. Less work has focused on using these models to examine how TF networks respond to changes in the cellular environment. Methods: In this paper, we have developed a simple, pragmatic methodology, TIGERi (Transcription-factor-activity Illustrator for Global Explanation of Regulatory interaction), to model the response of an inferred TF network to changes in cellular environment. The methodology was tested using publicly available data comparing gene expression profiles of a mouse p38α (Mapk14) knock-out line to the original wild-type. Results: Using the model, we have examined changes in the TF network resulting from the presence or absence of p38α. A part of this network was confirmed by experimental work in the original paper. Additional relationships were identified by our analysis, for example between p38α and HNF3, and between p38α and SOX9, and these are strongly supported by published evidence. FXR and MYC were also discovered in our analysis as two novel links of p38α. To provide a computational methodology to the biomedical communities that has more user-friendly interface, we also developed a standalone GUI (graphical user interface) software for TIGERi and it is freely available at https:\/\/github.com\/namshik\/tigeri\/.Conclusions: We therefore believe that our computational approach can identify new members of networks and new interactions between members that are supported by published data but have not been integrated into the existing network models. Moreover, ones who want to analyze their own data with TIGERi could use the software without any command line experience. This work could therefore accelerate researches in transcriptional gene regulation in higher eukaryotes.","language":[""],"publicationDOI":["10.1186\/s12859-017-1636-6"],"publicationTitle":["TIGERi: modeling and visualizing the responses to perturbation of a transcription factor network"],"repoUpdatedDate":"2016-07-23T16:37:00Z","repoHomepage":"","institutions":["University of Cambridge","University of Liverpool","University of Manchester"],"linkUrls":["github.com\/namshik\/tigeri\/","github.com\/namshik\/tigeri\/.Conclusions:","bmcbioinformatics.biomedcentral.com\/articles\/supplements\/volume-18-supplement-7"],"license":"No License","repoCreationDate":"2015-03-14T09:36:19Z","_version_":1585444512650493952,"name":"TIGERi","id":43,"suggestNamePrefix":"TIGERi","repoDownloads":0,"publicationDate":["0"],"repoForks":1,"authors":["Namshik Han","Harry A. Noyes","Andy Brass"]},{"codeRepoURL":"https:\/\/github.com\/jkruppa\/kmerPyramid","repoDescription":"R package to visualize the kmer distribution between samples","repoName":"kmerPyramid","suggestName":"kmerPyramid","repo":"github","description":"Summary: Bioinformatics methods often incorporate the frequency distribution of nulecobases or k-mers in DNA or RNA sequences, for example as part of metagenomic or phylogenetic analysis. Because the frequency matrix with sequences in the rows and nucleobases in the columns is multidimensional it is hard to visualize. We present the R-package 'kmerPyramid' that allows to display each sequence, based on its nucleobase or k-mer distribution projected to the space of principal components, as a point within a 3-dimensional, interactive pyramid. Using the computer mouse, the user can turn the pyramid's axes, zoom in and out and identify individual points. Additionally, the package provides the k-mer frequency matrices of about 2000 bacteria and 5000 virus reference sequences calculated from the NCBI RefSeq genbank. The 'kmerPyramid' can particularly be used for visualization of intra- and inter species differences. Availability and implementation: The R-package 'kmerPyramid' is available from the GitHub website at https:\/\/github.com\/jkruppa\/kmerPyramid.Contact: klaus.jung@tiho-hannover.de Supplementary information: Supplementary data are available at Bioinformatics online.","language":["R"],"publicationDOI":["10.1093\/bioinformatics\/btx385"],"publicationTitle":["kmerPyramid: an interactive visualization tool for nucleobase and k-mer frequencies"],"repoUpdatedDate":"2017-06-27T07:29:16Z","repoHomepage":"","institutions":["University of Veterinary Medicine Hannover","Institute for Animal Breeding and Genetics","Research Center for Emerging Infections and Zoonoses"],"linkUrls":["ftp.ncbi.nlm.nih.gov\/genomes\/genbank","github.com\/jkruppa\/kmerPyramid.Contact:"],"license":"GNU General Public License v3.0","repoCreationDate":"2016-08-04T12:12:02Z","_version_":1585444620092833792,"name":"kmerPyramid","id":46,"suggestNamePrefix":"kmerPyramid","repoDownloads":0,"publicationDate":["0"],"repoForks":0,"authors":["Jochen Kruppa","Erhard van der Vries","Wendy K. Jo","Alexander Postel","Paul Becher","Albert Osterhaus","Klaus Jung"]},{"codeRepoURL":"https:\/\/github.com\/clzani\/DEREP-NP","repoDescription":"Repository for files related to DEREP-NP dereplication database","repoName":"DEREP-NP","suggestName":"DEREP-NP","repo":"github","description":"The discovery of novel and\/or new bioactive natural products from biota sources is often confounded by the reisolation of known natural products. Dereplication strategies that involve the analysis of NMR and MS spectroscopic data to infer structural features present in purified natural products in combination with database searches of these substructures provide an efficient method to rapidly identify known natural products. Unfortunately this strategy has been hampered by the lack of publically available and comprehensive natural product databases and open source cheminformatics tools. A new platform, DEREP-NP, has been developed to help solve this problem. DEREP-NP uses the open source cheminformatics program DataWarrior to generate a database containing counts of 65 structural fragments present in 229 358 natural product structures derived from plants, animals, and microorganisms, published before 2013 and freely available in the nonproprietary Universal Natural Products Database (UNPD). By counting the number of times one or more of these structural features occurs in an unknown compound, as deduced from the analysis of its NMR (1H, HSQC, and\/or HMBC) and\/or MS data, matching structures carrying the same numeric combination of searched structural features can be retrieved from the database. Confirmation that the matching structure is the same compound can then be verified through literature comparison of spectroscopic data. This methodology can be applied to both purified natural products and fractions containing a small number of individual compounds that are often generated as screening libraries. The utility of DEREP-NP has been verified through the analysis of spectra derived from compounds (and fractions containing two or three compounds) isolated from plant, marine invertebrate, and fungal sources. DEREP-NP is freely available at https:\/\/github.com\/clzani\/DEREP-NP and will help to streamline the natural product discovery process.","language":[""],"publicationDOI":["10.1021\/acs.jnatprod.6b01093"],"publicationTitle":["Database for Rapid Dereplication of Known Natural Products Using Data from MS and Fast NMR Experiments"],"repoUpdatedDate":"2017-07-17T15:52:25Z","repoHomepage":"","institutions":["Centro de Pesquisa René Rachou-Fiocruz"],"linkUrls":["github.com\/clzani\/DEREP-NP;","github.com\/clzani\/DEREP-NP","github.com\/clzani\/DEREP-NP,"],"license":"No License","repoCreationDate":"2017-02-14T15:11:40Z","_version_":1585444493787660288,"name":"DEREP-NP","id":42,"suggestNamePrefix":"DEREP-NP","repoDownloads":0,"publicationDate":["11\/24\/2016"],"repoForks":0,"authors":["Carlos L. Zani","Anthony R. Carroll"]},{"codeRepoURL":"https:\/\/github.com\/bioconda\/bioconda-recipes","repoDescription":"Conda recipes for the bioconda channel.","repoName":"bioconda-recipes","suggestName":"FQC Dashboard","repo":"github","description":"Summary: FQC is software that facilitates quality control of FASTQ files by carrying out a QC protocol using FastQC, parsing results, and aggregating quality metrics into an interactive dashboard designed to richly summarize individual sequencing runs. The dashboard groups samples in dropdowns for navigation among the data sets, utilizes human-readable configuration files to manipulate the pages and tabs, and is extensible with CSV data. Availability and implementation: FQC is implemented in Python 3 and Javascript, and is maintained under an MIT license. Documentation and source code is available at: https:\/\/github.com\/pnnl\/fqc. Contact: joseph.brown@pnnl.gov","language":["Shell"],"publicationDOI":["10.1093\/bioinformatics\/btx373"],"publicationTitle":["FQC Dashboard: integrates FastQC results into a web-based, interactive, and extensible FASTQ quality control tool"],"repoUpdatedDate":"2017-11-27T05:48:02Z","repoHomepage":"https:\/\/bioconda.github.io","institutions":["Pacific Northwest National Laboratory"],"linkUrls":["www.continuum.io\/downloads","github.com\/bioconda\/bioconda-recipes","github.com\/pnnl\/fqc"],"license":"No License","repoCreationDate":"2015-09-12T20:33:30Z","_version_":1585444462135345152,"name":"FQC Dashboard","id":39,"suggestNamePrefix":"FQC Dashboard","repoDownloads":0,"publicationDate":["0"],"repoForks":507,"authors":["Joseph Brown","Meg Pirrung","Lee Ann McCue"]},{"codeRepoURL":"https:\/\/github.com\/hcji\/KPIC2","repoDescription":"KPIC2: An Effective Framework for Mass Spectrometry-Based Metabolomics Using Pure Ion Chromatograms","repoName":"KPIC2","suggestName":"KPIC2","repo":"github","description":"Distilling accurate quantitation information on metabolites from liquid chromatography coupled with mass spectrometry (LC-MS) data sets is crucial for further statistical analysis and biomarker identification. However, it is still challenging due to the complexity of biological systems. The concept of pure ion chromatograms (PICs) is an effective way of extracting meaningful ions, but few toolboxes provide a full processing workflow for LCMS data sets based on PICs. In this study, an integrated framework, KPIC2, has been developed for metabolomics studies, which can detect pure ions accurately, align PICs across samples, group PICs to identify isotope and potential adducts, fill missing peaks and do multivariate pattern recognition. To evaluate its performance, MM48, metabolomics quantitation, and Soybean seeds data sets have been analyzed using KPIC2, XCMS, and MZmine2. KPIC2 can extract more true ions with fewer detecting features, have good quantification ability on a metabolomics quantitation data set, and achieve satisfactory classification on a soybean seeds data set through kernel-based OPLS-DA and random forest. It is implemented in R programming language, and the software, user guide, as well as example scripts and data sets are available as an open source package at https:\/\/github.com\/hcji\/KPIC2.","language":["R"],"publicationDOI":["10.1021\/acs.analchem.7b01547"],"publicationTitle":["KPIC2: An Effective Framework for Mass Spectrometry-Based Metabolomics Using Pure Ion Chromatograms"],"repoUpdatedDate":"2017-11-27T08:26:25Z","repoHomepage":"","institutions":["Central South University"],"linkUrls":["github.com\/hcji\/KPIC2.■","github.com\/hcji\/KPIC2"],"license":"No License","repoCreationDate":"2016-12-07T05:25:33Z","_version_":1585444529801003008,"name":"KPIC2","id":44,"suggestNamePrefix":"KPIC2","repoDownloads":0,"publicationDate":["6\/16\/2017"],"repoForks":2,"authors":["Hongchao Ji","Fanjuan Zeng","Yamei Xu","Hongmei Lu","Zhimin Zhang"]},{"codeRepoURL":"https:\/\/github.com\/moleculardistancemaps\/MoDMaps3D","repoDescription":"Build your Molecular Distance Map and visualize it in 3D!","repoName":"MoDMaps3D","suggestName":"MoDMaps3D","repo":"github","description":"Summary: MoDMaps3D (Molecular Distance Maps 3D) is an alignment-free, fast, computationally lightweight webtool for computing and visualizing the interrelationships within any dataset of DNA sequences, based on pairwise comparisons between their oligomer compositions. MoDMaps3D is a general-purpose interactive webtool that is free of any requirements on sequence composition, position of the sequences in their respective genomes, presence or absence of similarity or homology, sequence length, or even sequence origin (biological or computer-generated). Availability and implementation: MoDMaps3D is open source, cross-platform compatible, and is available under the MIT license at http:\/\/moleculardistancemaps.github.io\/MoDMaps3D\/. The source code is available at https:\/\/github.com\/moleculardistancemaps\/MoDMaps3D\/.Contact: lila@uwaterloo.ca Supplementary information: Supplementary data are available at Bioinformatics online.","language":["JavaScript"],"publicationDOI":["10.1093\/bioinformatics\/btx367"],"publicationTitle":["MoDMaps3D: an interactive webtool for the quantification and 3D visualization of interrelationships in a dataset of DNA sequences"],"repoUpdatedDate":"2017-03-20T17:51:22Z","repoHomepage":"","institutions":["University of Western Ontario","University of Waterloo"],"linkUrls":["moleculardistancemaps.github.io\/MoDMaps3D\/","github.com\/moleculardistancemaps\/MoDMaps3D\/"],"license":"MIT License","repoCreationDate":"2017-02-23T03:46:20Z","_version_":1585444468478181376,"name":"MoDMaps3D","id":40,"suggestNamePrefix":"MoDMaps3D","repoDownloads":0,"publicationDate":["0"],"repoForks":0,"authors":["Rallis Karamichalis","Lila Kari"]},{"codeRepoURL":"https:\/\/github.com\/appliedbioinformatics\/runBNG","repoDescription":"An easy way to run BioNano genomic analysis","repoName":"runBNG","suggestName":"runBNG","repo":"github","description":"Summary: We developed runBNG, an open-source software package which wraps BioNano genomic analysis tools into a single script that can be run on the command line. runBNG can complete analyses, including quality control of single molecule maps, optical map de novo assembly, comparisons between different optical maps, super-scaffolding and structural variation detection. Compared to existing software BioNano IrysView and the KSU scripts, the major advantages of runBNG are that the whole pipeline runs on one single platform and it has a high customizability. Availability and implementation: runBNG is written in bash, with the requirement of BioNano IrysSolve packages, GCC, Perl and Python software. It is freely available at https:\/\/github.com\/appliedbioinformatics\/runBNG. Contact: dave.edwards@uwa.edu.au Supplementary information: Supplementary data are available at Bioinformatics online.","language":["Shell"],"publicationDOI":["10.1093\/bioinformatics\/btx366"],"publicationTitle":["runBNG: a software package for BioNano genomic analysis on the command line"],"repoUpdatedDate":"2017-11-14T07:16:36Z","repoHomepage":"","institutions":["University of Queensland","University of Western Australia"],"linkUrls":["github.com\/appliedbioinformatics\/runBNG"],"license":"MIT License","repoCreationDate":"2016-11-24T09:16:34Z","_version_":1585444475691335680,"name":"runBNG","id":41,"suggestNamePrefix":"runBNG","repoDownloads":0,"publicationDate":["0"],"repoForks":1,"authors":["Yuxuan Yuan","Philipp E. Bayer","Huey-Tyng Lee","David Edwards"]},{"codeRepoURL":"https:\/\/github.com\/samocooper\/NucliTrack","repoDescription":"A python developed graphical user interface for tracking cell nuclei","repoName":"nuclitrack","suggestName":"NucliTrack","repo":"github","description":"Summary: Live imaging studies give unparalleled insight into dynamic single cell behaviours and fate decisions. However, the challenge of reliably tracking single cells over long periods of time limits both the throughput and ease with which such studies can be performed. Here, we present NucliTrack, a cross platform solution for automatically segmenting, tracking and extracting features from fluorescently labelled nuclei. NucliTrack performs similarly to other state-of-the-art cell tracking algorithms, but NucliTrack's interactive, graphical interface makes it significantly more user friendly. Availability and implementation: NucliTrack is available as a free, cross platform application and open source Python package. Installation details and documentation are at: http:\/\/nuclitrack.read thedocs.io\/en\/latest\/ A video guide can be viewed online: https:\/\/www.youtube.com\/watch? v¼J6e0D9F-qSU Source code is available through Github: https:\/\/github.com\/samocooper\/nucli track. A Matlab toolbox is also available at: https:\/\/uk.mathworks.com\/matlabcentral\/fileexchange\/61479-samocooper-nuclitrack-matlab. Contact: sam@socooper.com Supplementary information: Supplementary data are available at Bioinformatics online.","language":["Python"],"publicationDOI":["10.1093\/bioinformatics\/btx404"],"publicationTitle":["NucliTrack: an integrated nuclei tracking application"],"repoUpdatedDate":"2017-11-12T17:46:12Z","repoHomepage":"","institutions":["Imperial College","The Institute of Cancer Research"],"linkUrls":["www.youtube.com\/watch?","github.com\/samocooper\/nucli","uk.mathworks.com\/matlabcentral\/fileexchange\/61479-samocooper-nuclitrack-matlab"],"license":"No License","repoCreationDate":"2017-02-03T11:03:09Z","_version_":1585444660493418496,"name":"NucliTrack","id":50,"suggestNamePrefix":"NucliTrack","repoDownloads":0,"publicationDate":["0"],"repoForks":1,"authors":["Sam Cooper","Alexis R. Barr","Robert Glen","Chris Bakal"]},{"codeRepoURL":"https:\/\/github.com\/liyao001\/BioQueue","repoDescription":"A novel pipeline framework to accelerate bioinformatics analysis","repoName":"BioQueue","suggestName":"BioQueue","repo":"github","description":"Motivation: With the rapid development of Next-Generation Sequencing, a large amount of data is now available for bioinformatics research. Meanwhile, the presence of many pipeline frameworks makes it possible to analyse these data. However, these tools concentrate mainly on their syntax and design paradigms, and dispatch jobs based on users' experience about the resources needed by the execution of a certain step in a protocol. As a result, it is difficult for these tools to maximize the potential of computing resources, and avoid errors caused by overload, such as memory overflow. Results: Here, we have developed BioQueue, a web-based framework that contains a checkpoint before each step to automatically estimate the system resources (CPU, memory and disk) needed by the step and then dispatch jobs accordingly. BioQueue possesses a shell command-like syntax instead of implementing a new script language, which means most biologists without computer programming background can access the efficient queue system with ease. Availability and implementation: BioQueue is freely available at https:\/\/github.com\/liyao001\/BioQueue. The extensive documentation can be found at http:\/\/bioqueue.readthedocs.io.Contact: li_yao@outlook.com or gcsui@nefu.edu.cn Supplementary information: Supplementary data are available at Bioinformatics online.","language":["Python"],"publicationDOI":["10.1093\/bioinformatics\/btx403"],"publicationTitle":["BioQueue: a novel pipeline framework to accelerate bioinformatics analysis"],"repoUpdatedDate":"2017-10-26T02:10:31Z","repoHomepage":"","institutions":["Northeast Forestry University","Shanghai Tech University"],"linkUrls":["github.com\/liyao001\/BioQueue"],"license":"Apache License 2.0","repoCreationDate":"2017-03-12T06:46:59Z","_version_":1585444636852224000,"name":"BioQueue","id":48,"suggestNamePrefix":"BioQueue","repoDownloads":0,"publicationDate":["0"],"repoForks":6,"authors":["Li Yao","Heming Wang","Yuanyuan Song","Guangchao Sui"]},{"codeRepoURL":"https:\/\/github.com\/hzi-bifo\/eden","repoDescription":"EDEN: evolutionary dynamics within environments","repoName":"eden","suggestName":"EDEN","repo":"github","description":"Summary: Metagenomics revolutionized the field of microbial ecology, giving access to Gb-sized datasets of microbial communities under natural conditions. This enables fine-grained analyses of the functions of community members, studies of their association with phenotypes and environments, as well as of their microevolution and adaptation to changing environmental conditions. However, phylogenetic methods for studying adaptation and evolutionary dynamics are not able to cope with big data. EDEN is the first software for the rapid detection of protein families and regions under positive selection, as well as their associated biological processes, from meta- and pangenome data. It provides an interactive result visualization for detailed comparative analyses. Availability and implementation: EDEN is available as a Docker installation under the GPL 3.0 license, allowing its use on common operating systems, at http:\/\/www.github.com\/hzi-bifo\/eden.Contact: alice.mchardy@helmholtz-hzi.de Supplementary information: Supplementary data are available at Bioinformatics online.","language":["Python"],"publicationDOI":["10.1093\/bioinformatics\/btx394"],"publicationTitle":["EDEN: evolutionary dynamics within environments"],"repoUpdatedDate":"2017-06-08T16:34:27Z","repoHomepage":"http:\/\/eden.bifo.helmholtz-hzi.de\/","institutions":["Heinrich Heine University Dusseldorf","Helmholtz Centre for Infection Research","Partner Site LMU Munich","Department of Algorithmic Bioinformatics","German Centre for Infection Research (DZIF)","Ludwig-Maximilian University of Munich"],"linkUrls":["www.github.com\/hzi-bifo\/eden.Contact:"],"license":"No License","repoCreationDate":"2017-06-08T16:34:25Z","_version_":1585444689358618624,"name":"EDEN","id":53,"suggestNamePrefix":"EDEN","repoDownloads":0,"publicationDate":["0"],"repoForks":0,"authors":["Philipp C. Mu¨ nch","Ba€rbel Stecher","Alice C. McHardy"]},{"codeRepoURL":"https:\/\/github.com\/tianhe2\/gromacs-mic","repoDescription":"a version of GROMACS run on MIC with offload mode","repoName":"gromacs-mic","suggestName":"gromacs-mic","repo":"github","description":"-Molecular Dynamics (MD) is the simulation of the dynamic behavior of atoms and molecules. As the most popular software for molecular dynamics, GROMACS cannot work on large-scale data because of limit computing resources. In this paper, we propose a CPU and Intel® Xeon Phi Many Integrated Core (MIC) collaborated parallel framework to accelerate GROMACS using the offload mode on a MIC coprocessor, with which the performance of GROMACS is improved significantly, especially with the utility of Tianhe-2 supercomputer. Furthermore, we optimize GROMACS so that it can run on both the CPU and MIC at the same time. In addition, we accelerate multi-node GROMACS so that it can be used in practice. Benchmarking on real data, our accelerated GROMACS performs very well and reduces computation time significantly. Source code: https:\/\/github.com\/tianhe2\/gromacs-mic","language":["C"],"publicationDOI":["10.1109\/TCBB.2017.2713362"],"publicationTitle":["A CPU\/MIC Collaborated Parallel Framework for GROMACS on Tianhe-2 Supercomputer"],"repoUpdatedDate":"2016-05-12T00:33:06Z","repoHomepage":"","institutions":["Tongji University","Shandong University","National University of Defense Technology Changsha"],"linkUrls":["github.com\/tianhe2\/gromacs-mic"],"license":"Other","repoCreationDate":"2016-05-12T00:01:56Z","_version_":1585444727289806848,"name":"gromacs-mic","id":54,"suggestNamePrefix":"gromacs-mic","repoDownloads":0,"publicationDate":["0"],"repoForks":0,"authors":["E-mail:pengshaoliang@nudt.edu.cn","Corresponding author","Equal Contributors"]},{"codeRepoURL":"https:\/\/github.com\/itsmeludo\/Phyloligo","repoDescription":"Bioinformatics \/ Explore oligonucleotide composition similarity between assembly contigs or scaffolds to detect contaminant DNA.","repoName":"PhylOligo","suggestName":"PhylOligo","repo":"github","description":"Motivation: Genome sequencing projects sometimes uncover more organisms than expected, especially for complex and\/or non-model organisms. It is therefore useful to develop software to identify mix of organisms from genome sequence assemblies. Results: Here we present PhylOligo, a new package including tools to explore, identify and extract organism-specific sequences in a genome assembly using the analysis of their DNA compositional characteristics. Availability and implementation: The tools are written in Python3 and R under the GPLv3 Licence and can be found at https:\/\/github.com\/itsmeludo\/Phyloligo\/.Contact: ludovic.mallet@inra.fr Supplementary information: Supplementary data are available at Bioinformatics online.","language":["Python"],"publicationDOI":["10.1093\/bioinformatics\/btx396"],"publicationTitle":["PhylOligo: a package to identify contaminant or untargeted organism sequences in genome assemblies"],"repoUpdatedDate":"2016-10-27T09:40:02Z","repoHomepage":"","institutions":["IRD - IUC","Unite ́ Mathe ́ matiques et Informatique Applique ́ es de Toulouse (MIAT)"],"linkUrls":["github.com\/itsmeludo\/Phyloligo\/"],"license":"GNU General Public License v3.0","repoCreationDate":"2016-06-17T08:36:22Z","_version_":1585444668020097024,"name":"PhylOligo","id":51,"suggestNamePrefix":"PhylOligo","repoDownloads":0,"publicationDate":["0"],"repoForks":2,"authors":["Ludovic Mallet","Tristan Bitard-Feildel","Franck Cerutti","He´ l e`ne Chiapello"]},{"codeRepoURL":"https:\/\/github.com\/izhbannikov\/rqt","repoDescription":"This is a read-only mirror of the Bioconductor SVN repository. Package Homepage: http:\/\/bioconductor.org\/packages\/devel\/bioc\/html\/rqt.html Contributions: https:\/\/github.com\/izhbannikov\/rqt. Bug Reports: https:\/\/support.bioconductor.org\/p\/new\/post\/?tag_val=rqt or https:\/\/github.com\/izhbannikov\/rqt\/issues.","repoName":"rqt","suggestName":"rqt","repo":"github","description":"Motivation: Despite recent advances of modern GWAS methods, it is still remains an important problem of addressing calculation an effect size and corresponding p-value for the whole gene rather than for single variant. Results: We developed an R package rqt, which offers gene-level GWAS meta-analysis. The package can be easily included into bioinformatics pipeline or used stand-alone. We applied this tool to the analysis of Alzheimer's disease data from three datasets CHS, FHS and LOADFS. Test results from meta-analysis of three Alzheimer studies show its applicability for association testing. Availability and implementation: The package rqt is freely available under the following link: https:\/\/github.com\/izhbannikov\/rqt.Contact: ilya.zhbannikov@duke.edu Supplementary information: Supplementary data are available at Bioinformatics online.","language":["R"],"publicationDOI":["10.1093\/bioinformatics\/btx395"],"publicationTitle":["rqt: an R package for gene-level meta-analysis"],"repoUpdatedDate":"2017-09-04T10:31:08Z","repoHomepage":"","institutions":["Duke University"],"linkUrls":["github.com\/izhbannikov\/rqt","github.com\/izhbannikov\/rqt.Contact:"],"license":"No License","repoCreationDate":"2017-05-29T02:34:30Z","_version_":1585444628266483712,"name":"rqt","id":47,"suggestNamePrefix":"rqt","repoDownloads":0,"publicationDate":["0"],"repoForks":1,"authors":["Ilya Y. Zhbannikov","Konstantin G. Arbeev","Anatoliy I. Yashin"]},{"codeRepoURL":"https:\/\/github.com\/sjackman\/gfalint","repoDescription":"Check a GFA file for syntax errors","repoName":"gfalint","suggestName":"GfaPy","repo":"github","description":"Summary: GFA 1 and GFA 2 are recently defined formats for representing sequence graphs, such as assembly, variation or splicing graphs. The formats are adopted by several software tools. Here, we present GfaPy, a software package for creating, parsing and editing GFA graphs using the programming language Python. GfaPy supports GFA 1 and GFA 2, using the same interface and allows for interconversion between both formats. The software package provides a simple interface for custom record types, which is an important new feature of GFA 2 (compared to GFA 1). This enables new applications of the format. Availability and implementation: GfaPy is available open source at https:\/\/github.com\/ggon nella\/gfapy and installable via pip. Contact: gonnella@zbh.uni-hamburg.de Supplementary information: Supplementary data are available at Bioinformatics online.","language":["Yacc"],"publicationDOI":["10.1093\/bioinformatics\/btx398"],"publicationTitle":["GfaPy: a flexible and extensible software library for handling sequence graphs in Python"],"repoUpdatedDate":"2017-06-19T18:10:17Z","repoHomepage":"","institutions":["Universita€t Hamburg"],"linkUrls":["github.com\/sjackman\/gfalint","github.com\/thegenemyers\/DFA-SPEC","github.com\/GFA-spec\/GFA-spec","git.io\/vyXr6","github.com\/pmelsted\/pyGFA","github.com\/lh3\/miniasm","github.com\/GFA-spec\/GFA-spec\/blob\/master\/GFA2.md","github.com\/vgteam\/vg","github.com\/ggon"],"license":"MIT License","repoCreationDate":"2016-09-28T23:23:00Z","_version_":1585444736618987520,"name":"GfaPy","id":55,"suggestNamePrefix":"GfaPy","repoDownloads":0,"publicationDate":["0"],"repoForks":0,"authors":["Giorgio Gonnella","Stefan Kurtz"]},{"codeRepoURL":"https:\/\/github.com\/zhqingit\/BPP","repoDescription":"","repoName":"BPP","suggestName":"BPP","repo":"github","description":"Motivation: Although high-throughput sequencing methods have been proposed to identify splicing branch points in the human genome, these methods can only detect a small fraction of the branch points subject to the sequencing depth, experimental cost and the expression level of the mRNA. An accurate computational model for branch point prediction is therefore an ongoing objective in human genome research. Results: We here propose a novel branch point prediction algorithm that utilizes information on the branch point sequence and the polypyrimidine tract. Using experimentally validated data, we demonstrate that our proposed method outperforms existing methods. Availability and implementation: https:\/\/github.com\/zhqingit\/BPP.Contact: djguo@cuhk.edu.hk Supplementary information: Supplementary data are available at Bioinformatics online.","language":["Python"],"publicationDOI":["10.1093\/bioinformatics\/btx401"],"publicationTitle":["BPP: a sequence-based algorithm for branch point prediction"],"repoUpdatedDate":"2016-12-29T05:44:16Z","repoHomepage":"","institutions":["Shenzhen University Health Science Center","The Chinese University of Hong Kong","Zhejiang University","School of Life Sciences and the State Key Laboratory of Agrobiotechnology"],"linkUrls":["github.com\/zhqingit\/BPP.Contact:"],"license":"Other","repoCreationDate":"2016-12-18T23:43:47Z","_version_":1585444649719300096,"name":"BPP","id":49,"suggestNamePrefix":"BPP","repoDownloads":0,"publicationDate":["0"],"repoForks":0,"authors":["Qing Zhang","Xiaodan Fan","Yejun Wang","Ming-an Sun","Jianlin Shao","Dianjing Guo"]},{"codeRepoURL":"https:\/\/github.com\/aquaskyline\/16GT","repoDescription":"Simultaneous detection of SNPs and Indels using a 16-genotype probabilistic model","repoName":"16GT","suggestName":"16GT","repo":"github","description":"16GT is a variant caller for Illumina whole-genome and whole-exome sequencing data. It uses a new 16-genotype probabilistic model to unify single nucleotide polymorphism and insertion and deletion calling in a single variant calling algorithm. In benchmark comparisons with 5 other widely used variant callers on a modern 36-core server, 16GT demonstrated improved sensitivity in calling single nucleotide polymorphisms, and it provided comparable sensitivity and accuracy for calling insertions and deletions as compared to the GATK HaplotypeCaller. 16GT is available at https:\/\/github.com\/aquaskyline\/16GT.","language":["Perl"],"publicationDOI":["10.1093\/gigascience\/gix045"],"publicationTitle":["16GT: a fast and sensitive variant caller using a 16-genotype probabilistic model"],"repoUpdatedDate":"2017-08-01T15:05:16Z","repoHomepage":"","institutions":["Johns Hopkins University School of Medicine","Johns Hopkins University"],"linkUrls":["github.com\/aquaskyline\/16GT","github.com\/aquaskyline\/16GT\/releases\/tag\/1.0"],"license":"No License","repoCreationDate":"2017-01-03T19:55:45Z","_version_":1585444678845595648,"name":"16GT","id":52,"suggestNamePrefix":"16GT","repoDownloads":0,"publicationDate":["6\/13\/2017"],"repoForks":2,"authors":["Ruibang Luo","Michael C. Schatz","Steven L. Salzberg"]},{"codeRepoURL":"https:\/\/github.com\/oarnaiz\/TrUC","repoDescription":"Transcription Units by Coverage","repoName":"TrUC","suggestName":"Improved methods and resources for paramecium genomics","repo":"github","description":"Background: The 15 sibling species of the Paramecium aurelia cryptic species complex emerged after a whole genome duplication that occurred tens of millions of years ago. Given extensive knowledge of the genetics and epigenetics of Paramecium acquired over the last century, this species complex offers a uniquely powerful system to investigate the consequences of whole genome duplication in a unicellular eukaryote as well as the genetic and epigenetic mechanisms that drive speciation. High quality Paramecium gene models are important for research using this system. The major aim of the work reported here was to build an improved gene annotation pipeline for the Paramecium lineage. Results: We generated oriented RNA-Seq transcriptome data across the sexual process of autogamy for the model species Paramecium tetraurelia. We determined, for the first time in a ciliate, candidate P. tetraurelia transcription start sites using an adapted Cap-Seq protocol. We developed TrUC, multi-threaded Perl software that in conjunction with TopHat mapping of RNA-Seq data to a reference genome, predicts transcription units for the annotation pipeline. We used EuGene software to combine annotation evidence. The high quality gene structural annotations obtained for P. tetraurelia were used as evidence to improve published annotations for 3 other Paramecium species. The RNA-Seq data were also used for differential gene expression analysis, providing a gene expression atlas that is more sensitive than the previously established microarray resource. Conclusions: We have developed a gene annotation pipeline tailored for the compact genomes and tiny introns of Paramecium species. A novel component of this pipeline, TrUC, predicts transcription units using Cap-Seq and oriented RNA-Seq data. TrUC could prove useful beyond Paramecium, especially in the case of high gene density. Accurate predictions of 3′ and 5′ UTR will be particularly valuable for studies of gene expression (e.g. nucleosome positioning, identification of cis regulatory motifs). The P. tetraurelia improved transcriptome resource, gene annotations for P. tetraurelia, P. biaurelia, P. sexaurelia and P. caudatum, and Paramecium-trained EuGene configuration are available through ParameciumDB (http:\/\/paramecium.i2bc.paris-saclay.fr). TrUC software is freely distributed under a GNU GPL v3 licence (https:\/\/github.com\/oarnaiz\/TrUC).","language":["Perl"],"publicationDOI":["10.1186\/s12864-017-3887-z"],"publicationTitle":["Improved methods and resources for paramecium genomics: transcription units, gene annotation and gene expression"],"repoUpdatedDate":"2017-02-17T13:39:25Z","repoHomepage":"","institutions":["Université Paris-Saclay","Université Paris Diderot","CNRS"],"linkUrls":["github.com\/oarnaiz\/TrUC"],"license":"GNU General Public License v3.0","repoCreationDate":"2017-02-15T14:03:14Z","_version_":1585444870655311872,"name":"Improved methods and resources for paramecium genomics","id":61,"suggestNamePrefix":"Improved methods and resources for paramecium genomics","repoDownloads":0,"publicationDate":["6\/21\/2017"],"repoForks":0,"authors":["Olivier Arnaiz","Erwin Van Dijk","Mireille Bétermier","Maoussi Lhuillier-Akakpo","Augustin de Vanssay","Sandra Duharcourt","Erika Sallet","Jérôme Gouzy","Linda Sperling"]},{"codeRepoURL":"https:\/\/github.com\/UdeM-LBIT\/CoreTracker","repoDescription":"CoreTracker, a codon reassignment tracker ","repoName":"CoreTracker","suggestName":"CoreTracker","repo":"github","description":"Motivation: Codon reassignments have been reported across all domains of life. With the increasing number of sequenced genomes, the development of systematic approaches for genetic code detection is essential for accurate downstream analyses. Three automated prediction tools exist so far: FACIL, GenDecoder and Bagheera; the last two respectively restricted to metazoan mitochondrial genomes and CUG reassignments in yeast nuclear genomes. These tools can only analyze a single genome at a time and are often not followed by a validation procedure, resulting in a high rate of false positives. Results: We present CoreTracker, a new algorithm for the inference of sense-to-sense codon reassignments. CoreTracker identifies potential codon reassignments in a set of related genomes, then uses statistical evaluations and a random forest classifier to predict those that are the most likely to be correct. Predicted reassignments are then validated through a phylogeny-aware step that evaluates the impact of the new genetic code on the protein alignment. Handling simultaneously a set of genomes in a phylogenetic framework, allows tracing back the evolution of each reassignment, which provides information on its underlying mechanism. Applied to metazoan and yeast genomes, CoreTracker significantly outperforms existing methods on both precision and sensitivity. Availability and implementation: CoreTracker is written in Python and available at https:\/\/github.com\/UdeM-LBIT\/CoreTracker. Contact: mabrouk@iro.umontreal.ca Supplementary information: Supplementary data are available at Bioinformatics online.","language":["Python"],"publicationDOI":["10.1093\/bioinformatics\/btx421"],"publicationTitle":["CoreTracker: accurate codon reassignment prediction, applied to mitochondrial genomes"],"repoUpdatedDate":"2017-01-26T20:04:37Z","repoHomepage":"http:\/\/udem-lbit.github.io\/CoreTracker\/","institutions":["Universite ́ de Montre ́ al","McGill University"],"linkUrls":["github.com\/UdeM-LBIT\/CoreTracker"],"license":"GNU General Public License v3.0","repoCreationDate":"2015-04-02T15:14:59Z","_version_":1585444896155631616,"name":"CoreTracker","id":63,"suggestNamePrefix":"CoreTracker","repoDownloads":0,"publicationDate":["0"],"repoForks":1,"authors":["Emmanuel Noutahi","Virginie Calderon","Mathieu Blanchette","Franz B. Lang","Nadia El-Mabrouk"]},{"codeRepoURL":"https:\/\/github.com\/jtaghiyar\/kronos","repoDescription":" A workflow assembler for cancer genome analytics and informatics","repoName":"kronos","suggestName":"Kronos","repo":"github","description":"Background: The field of next-generation sequencing informatics has matured to a point where algorithmic advances in sequence alignment and individual feature detection methods have stabilized. Practical and robust implementation of complex analytical workflows (where such tools are structured into “best practices” for automated analysis of next-generation sequencing datasets) still requires significant programming investment and expertise. Results: We present Kronos, a software platform for facilitating the development and execution of modular, auditable, and distributable bioinformatics workflows. Kronos obviates the need for explicit coding of workflows by compiling a text configuration file into executable Python applications. Making analysis modules would still require programming. The framework of each workflow includes a run manager to execute the encoded workflows locally (or on a cluster or cloud), parallelize tasks, and log all runtime events. The resulting workflows are highly modular and configurable by construction, facilitating flexible and extensible meta-applications that can be modified easily through congfiuration file editing. The workoflws are fully encoded for ease of distribution and can be instantiated on external systems, a step toward reproducible research and comparative analyses. We introduce a framework for building Kronos components that function as shareable, modular nodes in Kronos workflows. Conclusions: The Kronos platform provides a standard framework for developers to implement custom tools, reuse existing tools, and contribute to the community at large. Kronos is shipped with both Docker and Amazon Web Services Machine Images. It is free, open source, and available through the Python Package Index and at https:\/\/github.com\/jtaghiyar\/kronos.","language":["Python"],"publicationDOI":["10.1093\/gigascience\/gix042"],"publicationTitle":["Kronos: a workflow assembler for genome analytics and informatics"],"repoUpdatedDate":"2017-11-01T18:17:33Z","repoHomepage":"","institutions":["University of Toronto","Simon Fraser University","British Columbia Cancer Agency","University of British Columbia","Ontario Institute for Cancer Research (OICR)"],"linkUrls":["github.com\/jtaghiyar\/kronos"],"license":"MIT License","repoCreationDate":"2015-12-08T02:31:30Z","_version_":1585444907271585792,"name":"Kronos","id":64,"suggestNamePrefix":"Kronos","repoDownloads":0,"publicationDate":["6\/7\/2017"],"repoForks":3,"authors":["M. Jafar Taghiyar","Jamie Rosner","Diljot Grewal","Bruno M. Grande","Radhouane Aniba","Jasleen Grewal","Paul C. Boutros","Ryan D. Morin","Ali Bashashati","Sohrab P. Shah"]},{"codeRepoURL":"https:\/\/github.com\/wangvsa\/CMSA","repoDescription":"Improved Center Star Algorithm for Multiple Sequences Alignment Based on CUDA","repoName":"CMSA","suggestName":"CMSA","repo":"github","description":"Background: The multiple sequence alignment (MSA) is a classic and powerful technique for sequence analysis in bioinformatics. With the rapid growth of biological datasets, MSA parallelization becomes necessary to keep its running time in an acceptable level. Although there are a lot of work on MSA problems, their approaches are either insufficient or contain some implicit assumptions that limit the generality of usage. First, the information of users' sequences, including the sizes of datasets and the lengths of sequences, can be of arbitrary values and are generally unknown before submitted, which are unfortunately ignored by previous work. Second, the center star strategy is suited for aligning similar sequences. But its first stage, center sequence selection, is highly time-consuming and requires further optimization. Moreover, given the heterogeneous CPU\/GPU platform, prior studies consider the MSA parallelization on GPU devices only, making the CPUs idle during the computation. Co-run computation, however, can maximize the utilization of the computing resources by enabling the workload computation on both CPU and GPU simultaneously. Results: This paper presents CMSA, a robust and efficient MSA system for large-scale datasets on the heterogeneous CPU\/GPU platform. It performs and optimizes multiple sequence alignment automatically for users' submitted sequences without any assumptions. CMSA adopts the co-run computation model so that both CPU and GPU devices are fully utilized. Moreover, CMSA proposes an improved center star strategy that reduces the time complexity of its center sequence selection process from O(mn2) to O(mn). The experimental results show that CMSA achieves an up to 11× speedup and outperforms the state-of-the-art software. Conclusion: CMSA focuses on the multiple similar RNA\/DNA sequence alignment and proposes a novel bitmap based algorithm to improve the center star strategy. We can conclude that harvesting the high performance of modern GPU is a promising approach to accelerate multiple sequence alignment. Besides, adopting the co-run computation model can maximize the entire system utilization significantly. The source code is available at https:\/\/github.com\/wangvsa\/CMSA.","language":["C++"],"publicationDOI":["10.1186\/s12859-017-1725-6"],"publicationTitle":["CMSA: a heterogeneous CPU\/GPU computing system for multiple similar RNA\/DNA sequence alignment"],"repoUpdatedDate":"2016-08-31T01:45:16Z","repoHomepage":"","institutions":["Tianjin University"],"linkUrls":["www.ncbi.nlm.nih.gov\/pubmed","github.com\/wangvsa\/CMSA"],"license":"GNU General Public License v3.0","repoCreationDate":"2016-03-27T02:06:45Z","_version_":1585444802877456384,"name":"CMSA","id":58,"suggestNamePrefix":"CMSA","repoDownloads":0,"publicationDate":["6\/12\/2017"],"repoForks":0,"authors":["Xi Chen","Chen Wang","Shanjiang Tang","Ce Yu","Quan Zou"]},{"codeRepoURL":"https:\/\/github.com\/casecpb\/KSEA","repoDescription":"Kinase-Substrate Enrichment Analysis (KSEA) App","repoName":"KSEA","suggestName":"The KSEA App","repo":"github","description":"Summary: Computational characterization of differential kinase activity from phosphoproteomics datasets is critical for correctly inferring cellular circuitry and how signaling cascades are altered in drug treatment and\/or disease. Kinase-Substrate Enrichment Analysis (KSEA) offers a powerful approach to estimating changes in a kinase's activity based on the collective phosphorylation changes of its identified substrates. However, KSEA has been limited to programmers who are able to implement the algorithms. Thus, to make it accessible to the larger scientific community, we present a web-based application of this method: the KSEA App. Overall, we expect that this tool will offer a quick and user-friendly way of generating kinase activity estimates from highthroughput phosphoproteomics datasets. Availability and implementation: the KSEA App is a free online tool: casecpb.shinyapps.io\/ksea\/. The source code is on GitHub: github.com\/casecpb\/KSEA\/. The application is also available as the R package 'KSEAapp' on CRAN: CRAN.R-project.org\/package¼KSEAapp\/. Contact: mark.chance@case.edu Supplementary information: Supplementary data are available at Bioinformatics online.","language":["R"],"publicationDOI":["10.1093\/bioinformatics\/btx415"],"publicationTitle":["The KSEA App: a web-based tool for kinase activity inference from quantitative phosphoproteomics"],"repoUpdatedDate":"2017-05-02T20:46:24Z","repoHomepage":"","institutions":["Case Western Reserve University","Center for Proteomics and Bioinformatics"],"linkUrls":["github.com\/casecpb\/KSEA\/","casecpb.shinyapps.io\/ksea\/","github.com\/casecpb\/KSEAapp\/"],"license":"MIT License","repoCreationDate":"2017-02-11T20:08:43Z","_version_":1585444880290676736,"name":"The KSEA App","id":62,"suggestNamePrefix":"The KSEA App","repoDownloads":0,"publicationDate":["0"],"repoForks":0,"authors":["Danica D. Wiredja","Mehmet Koyutu¨ rk","Mark R. Chance"]},{"codeRepoURL":"https:\/\/github.com\/yuansliu\/HiRGC","repoDescription":"High-speed and high-ratio referential genome compression","repoName":"HiRGC","suggestName":"HiRGC","repo":"github","description":"Motivation: The rapidly increasing number of genomes generated by high-throughput sequencing platforms and assembly algorithms is accompanied by problems in data storage, compression and communication. Traditional compression algorithms are unable to meet the demand of high compression ratio due to the intrinsic challenging features of DNA sequences such as small alphabet size, frequent repeats and palindromes. Reference-based lossless compression, by which only the differences between two similar genomes are stored, is a promising approach with high compression ratio. Results: We present a high-performance referential genome compression algorithm named HiRGC. It is based on a 2-bit encoding scheme and an advanced greedy-matching search on a hash table. We compare the performance of HiRGC with four state-of-the-art compression methods on a benchmark dataset of eight human genomes. HiRGC takes <30 min to compress about 21 gigabytes of each set of the seven target genomes into 96-260 megabytes, achieving compression ratios of 217 to 82 times. This performance is at least 1.9 times better than the best competing algorithm on its best case. Our compression speed is also at least 2.9 times faster. HiRGC is stable and robust to deal with different reference genomes. In contrast, the competing methods' performance varies widely on different reference genomes. More experiments on 100 human genomes from the 1000 Genome Project and on genomes of several other species again demonstrate that HiRGC's performance is consistently excellent. Availability and implementation: The C þþ and Java source codes of our algorithm are freely available for academic and non-commercial use. They can be downloaded from https:\/\/github.com\/yuansliu\/HiRGC. Contact: jinyan.li@uts.edu.au Supplementary information: Supplementary data are available at Bioinformatics online.","language":["C++"],"publicationDOI":["10.1093\/bioinformatics\/btx412"],"publicationTitle":["High-speed and high-ratio referential genome compression"],"repoUpdatedDate":"2017-10-05T19:34:14Z","repoHomepage":"https:\/\/github.com\/yuansliu\/HiRGC","institutions":["University of Technology Sydney","National University of Singapore"],"linkUrls":["github.com\/yuansliu\/HiRGC","www.genome.gov\/sequencingcosts"],"license":"No License","repoCreationDate":"2017-01-26T02:20:00Z","_version_":1585444844976734208,"name":"HiRGC","id":60,"suggestNamePrefix":"HiRGC","repoDownloads":0,"publicationDate":["0"],"repoForks":2,"authors":["Yuansheng Liu","Hui Peng","Limsoon Wong","Jinyan Li"]},{"codeRepoURL":"https:\/\/github.com\/pascalkieslich\/mousetrap-os","repoDescription":"Mouse-tracking plugin for OpenSesame","repoName":"mousetrap-os","suggestName":"Mousetrap","repo":"github","description":"Mouse-tracking - the analysis of mouse movements in computerized experiments - is becoming increasingly popular in the cognitive sciences. Mouse movements are taken as an indicator of commitment to or conflict between choice options during the decision process. Using mouse-tracking, researchers have gained insight into the temporal development of cognitive processes across a growing number of psychological domains. In the current article, we present software that offers easy and convenient means of recording and analyzing mouse movements in computerized laboratory experiments. In particular, we introduce and demonstrate the mousetrap plugin that adds mouse-tracking to OpenSesame, a popular general-purpose graphical experiment builder. By integrating with this existing experimental software, mousetrap allows for the creation of mouse-tracking studies through a graphical interface, without requiring programming skills. Thus, researchers can benefit from the core features of a validated software package and the many extensions available for it (e.g., the integration with auxiliary hardware such as eye-tracking, or the support of interactive experiments). In addition, the recorded data can be imported directly into the statistical programming language R using the mousetrap package, which greatly facilitates analysis.","language":["Python"],"publicationDOI":["10.3758\/s13428-017-0900-z"],"publicationTitle":["Mousetrap: An integrated, open-source mouse-tracking package"],"repoUpdatedDate":"2017-11-02T14:28:11Z","repoHomepage":"","institutions":["University of Mannheim","University of Koblenz-Landau","Schloss Ehrenhof Ost","Max Planck Institute for Research on Collective Goods","Pascal J. Kieslich"],"linkUrls":["github.com\/pascalkieslich\/mousetrap-os#","github.com\/pascalkieslich\/mousetrap-os","github.com\/pascalkieslich\/mousetrap-os#installation","osdoc.cogsci.nl\/manual\/timing\/","pascalkieslich.github.io\/mousetrap\/","github.com\/pascalkieslich\/mousetrap-resources,","github.com\/pascalkieslich\/mousetrap-os#examples"],"license":"GNU General Public License v3.0","repoCreationDate":"2015-10-20T13:49:26Z","_version_":1585444782652522496,"name":"Mousetrap","id":57,"suggestNamePrefix":"Mousetrap","repoDownloads":0,"publicationDate":["0"],"repoForks":5,"authors":["Pascal J. Kieslich","Felix Henninger"]},{"codeRepoURL":"https:\/\/github.com\/MolecularBioinformatics\/sbml-mod-ws","repoDescription":"SBMLmod web service","repoName":"sbml-mod-ws","suggestName":"SBMLmod","repo":"github","description":"Background: Systems Biology Markup Language (SBML) is the standard model representation and description language in systems biology. Enriching and analysing systems biology models by integrating the multitude of available data, increases the predictive power of these models. This may be a daunting task, which commonly requires bioinformatic competence and scripting. Results: We present SBMLmod, a Python-based web application and service, that automates integration of high throughput data into SBML models. Subsequent steady state analysis is readily accessible via the web service COPASIWS. We illustrate the utility of SBMLmod by integrating gene expression data from different healthy tissues as well as from a cancer dataset into a previously published model of mammalian tryptophan metabolism. Conclusion: SBMLmod is a user-friendly platform for model modification and simulation. The web application is available at http:\/\/sbmlmod.uit.no, whereas the WSDL definition file for the web service is accessible via http:\/\/sbmlmod.uit.no\/SBMLmod.wsdl. Furthermore, the entire package can be downloaded from https:\/\/github.com\/MolecularBioinformatics\/sbml-mod-ws. We envision that SBMLmod will make automated model modification and simulation available to a broader research community.","language":["Python"],"publicationDOI":["10.1186\/s12859-017-1722-9"],"publicationTitle":["SBMLmod: a Python-based web application and web service for efficient data integration and model simulation"],"repoUpdatedDate":"2017-02-08T12:53:18Z","repoHomepage":"","institutions":["Uni Research Environment","UiT The Arctic University of Norway","University of Bergen","Equal contributors","Friedrich-Schiller-University Jena"],"linkUrls":["github.com\/MolecularBioinformatics\/sbml-mod-ws","github.com\/MolecularBioinformatics\/PyCopasi","www.ebi.ac.uk\/biomodels-main\/MODEL1310160000","sbmlmod.uit.no","www.ncbi.nlm.nih.gov\/geo\/query\/acc.cgi?acc=GSE7905","cancergenome.nih.gov"],"license":"GNU General Public License v2.0","repoCreationDate":"2014-06-17T10:25:57Z","_version_":1585444826187300864,"name":"SBMLmod","id":59,"suggestNamePrefix":"SBMLmod","repoDownloads":0,"publicationDate":["6\/9\/2017"],"repoForks":1,"authors":["Sascha Schäuble","Anne-Kristin Stavrum","Mathias Bockwoldt","Pål Puntervoll","Ines Heiland"]},{"codeRepoURL":"https:\/\/github.com\/hms-dbmi\/UpSetR","repoDescription":"An R implementation of the UpSet set visualization technique published by Lex, Gehlenborg, et al..  ","repoName":"UpSetR","suggestName":"UpSetR","repo":"github","description":"Motivation: Venn and Euler diagrams are a popular yet inadequate solution for quantitative visualization of set intersections. A scalable alternative to Venn and Euler diagrams for visualizing intersecting sets and their properties is needed. Results: We developed UpSetR, an open source R package that employs a scalable matrix-based visualization to show intersections of sets, their size, and other properties. Availability and implementation: UpSetR is available at https:\/\/github.com\/hms-dbmi\/UpSetR\/ and released under the MIT License. A Shiny app is available at https:\/\/gehlenborglab.shinyapps.io\/upsetr\/. Contact: nils@hms.harvard.edu Supplementary information: Supplementary data are available at Bioinformatics online.","language":["HTML"],"publicationDOI":["10.1093\/bioinformatics\/btx364"],"publicationTitle":["UpSetR: an R package for the visualization of intersecting sets and their properties"],"repoUpdatedDate":"2017-11-28T15:14:57Z","repoHomepage":"https:\/\/cran.rstudio.com\/web\/packages\/UpSetR","institutions":["Harvard Medical School","University of Utah"],"linkUrls":["github.com\/hms-dbmi\/UpSetR\/","gehlenborglab.shinyapps.io\/upsetr\/"],"license":"Other","repoCreationDate":"2015-05-26T18:29:34Z","_version_":1585444744230600704,"name":"UpSetR","id":56,"suggestNamePrefix":"UpSetR","repoDownloads":0,"publicationDate":["0"],"repoForks":46,"authors":["Jake R. Conway","Alexander Lex","Nils Gehlenborg"]},{"codeRepoURL":"https:\/\/github.com\/gohwils\/NetProt","repoDescription":"","repoName":"NetProt","suggestName":"NetProt: Complex-based Feature Selection","repo":"github","description":"Protein complex-based feature selection (PCBFS) provides unparalleled reproducibility with high phenotypic relevance on proteomics data. Currently, there are five PCBFS paradigms, but not all representative methods have been implemented or made readily available. To allow general users to take advantage of these methods, we developed the R-package NetProt, which provides implementations of representative feature-selection methods. NetProt also provides methods for generating simulated differential data and generating pseudocomplexes for complex-based performance benchmarking. The NetProt open source R package is available for download from https:\/\/github.com\/gohwils\/NetProt\/releases\/, and online documentation is available at http:\/\/rpubs.com\/gohwils\/204259.","language":["HTML"],"publicationDOI":["10.1021\/acs.jproteome.7b00363"],"publicationTitle":["NetProt: Complex-based Feature Selection"],"repoUpdatedDate":"2017-07-10T17:54:08Z","repoHomepage":"","institutions":["National University of Singapore","Nanyang Technological University","Tianjin University"],"linkUrls":["github.com\/gohwils\/NetProt\/releases\/,","github.com\/gohwils\/NetProt\/releases\/","github.com\/gohwils\/NetProt\/releases\/tag\/0.1\/Data.zip","rpubs.com\/gohwils\/204259"],"license":"GNU General Public License v3.0","repoCreationDate":"2017-05-30T08:24:29Z","_version_":1585444983623647232,"name":"NetProt: Complex-based Feature Selection","id":66,"suggestNamePrefix":"NetProt: Complex-based Feature Selection","repoDownloads":0,"publicationDate":["6\/1\/2017"],"repoForks":0,"authors":["Wilson W","n Bin Goh","Limsoon Wong"]},{"codeRepoURL":"https:\/\/github.com\/dongjunchung\/bayesGO","repoDescription":"bayesGO: Bayesian ontology fingerprint, a statistical framework for biomedical literature mining ","repoName":"bayesGO","suggestName":"dongjunchung","repo":"github","description":"In systems biology, it is of great interest to identify new genes that were not previously reported to be associated with biological pathways related to various functions and diseases. Identification of these new pathwaymodulating genes does not only promote understanding of pathway regulation mechanisms but also allow identification of novel targets for therapeutics. Recently, biomedical literature has been considered as a valuable resource to investigate pathway-modulating genes. While the majority of currently available approaches are based on the co-occurrence of genes within an abstract, it has been reported that these approaches show only sub-optimal performances because 70% of abstracts contain information only for a single gene. To overcome such limitation, we propose a novel statistical framework based on the concept of ontology fingerprint that uses gene ontology to extract information from large biomedical literature data. The proposed framework simultaneously identifies pathway-modulating genes and facilitates interpreting functions of these new genes. We also propose a computationally efficient posterior inference procedure based on Metropolis-Hastings within Gibbs sampler for parameter updates and the poor man's reversible jump Markov chain Monte Carlo approach for model selection. We evaluate the proposed statistical framework with simulation studies, experimental validation, and an application to studies of pathway-modulating genes in yeast. The R implementation of the proposed model is currently available at https:\/\/dongjunchung.github.io\/bayesGO\/. Copyright © 2017 John Wiley & Sons, Ltd.","language":["R"],"publicationDOI":["10.1002\/sim.7384"],"publicationTitle":["A statistical framework for biomedical literature mining"],"repoUpdatedDate":"2017-04-17T06:40:21Z","repoHomepage":"","institutions":["Medical University of South Carolina","The University of Texas Health Science Center at Houston"],"linkUrls":["www.ebi.ac.uk\/GOA","dongjunchung.github.io\/bayesGO\/","www.ncbi.nlm.nih.gov\/pubmed","www.yeastgenome.org\/"],"license":"No License","repoCreationDate":"2017-04-14T15:33:07Z","_version_":1585445056816349184,"name":"dongjunchung","id":68,"suggestNamePrefix":"dongjunchung","repoDownloads":0,"publicationDate":["6\/3\/2017"],"repoForks":0,"authors":["Dongjun Chung","Andrew Lawson","W. Jim Zheng"]},{"codeRepoURL":"https:\/\/github.com\/SharonLutz\/Umediation","repoDescription":"Examines how the results of the mediation analysis would change in the presence of unmeasured confounding.","repoName":"Umediation","suggestName":"Umediation","repo":"github","description":"Background: In mediation analysis if unmeasured confounding is present, the estimates for the direct and mediated effects may be over or under estimated. Most methods for the sensitivity analysis of unmeasured confounding in mediation have focused on the mediator-outcome relationship. Results: The Umediation R package enables the user to simulate unmeasured confounding of the exposure-mediator, exposure-outcome, and mediator-outcome relationships in order to see how the results of the mediation analysis would change in the presence of unmeasured confounding. We apply the Umediation package to the Genetic Epidemiology of Chronic Obstructive Pulmonary Disease (COPDGene) study to examine the role of unmeasured confounding due to population stratification on the effect of a single nucleotide polymorphism (SNP) in the CHRNA5\/ 3\/B4 locus on pulmonary function decline as mediated by cigarette smoking. Conclusions: Umediation is a flexible R package that examines the role of unmeasured confounding in mediation analysis allowing for normally distributed or Bernoulli distributed exposures, outcomes, mediators, measured confounders, and unmeasured confounders. Umediation also accommodates multiple measured confounders, multiple unmeasured confounders, and allows for a mediator-exposure interaction on the outcome. Umediation is available as an R package at https:\/\/github.com\/SharonLutz\/Umediation A tutorial on how to install and use the Umediation package is available in the Additional file 1.","language":["R"],"publicationDOI":["10.1186\/s12859-017-1749-y"],"publicationTitle":["Examining the role of unmeasured confounding in mediation analysis with genetic and genomic applications"],"repoUpdatedDate":"2017-07-05T23:48:28Z","repoHomepage":"","institutions":["University of Colorado Anschutz Medical Campus","Children's Hospital Colorado"],"linkUrls":["github.com\/SharonLutz\/Umediation"],"license":"No License","repoCreationDate":"2017-06-21T16:59:13Z","_version_":1585445277159915520,"name":"Umediation","id":71,"suggestNamePrefix":"Umediation","repoDownloads":0,"publicationDate":["7\/4\/2017"],"repoForks":1,"authors":["Sharon M. Lutz","Annie Thwing","Sarah Schmiege","Miranda Kroehl","Christopher D. Baker","Anne P. Starling","John E. Hokanson","Debashis Ghosh"]},{"codeRepoURL":"https:\/\/github.com\/ikalatskaya\/ISOWN","repoDescription":"","repoName":"ISOWN","suggestName":"ISOWN","repo":"github","description":"Background: A key step in cancer genome analysis is the identification of somatic mutations in the tumor. This is typically done by comparing the genome of the tumor to the reference genome sequence derived from a normal tissue taken from the same donor. However, there are a variety of common scenarios in which matched normal tissue is not available for comparison. Results: In this work, we describe an algorithm to distinguish somatic single nucleotide variants (SNVs) in next-generation sequencing data from germline polymorphisms in the absence of normal samples using a machine learning approach. Our algorithm was evaluated using a family of supervised learning classifications across six different cancer types and ~1600 samples, including cell lines, fresh frozen tissues, and formalin-fixed paraffin-embedded tissues; we tested our algorithm with both deep targeted and whole-exome sequencing data. Our algorithm correctly classified between 95 and 98% of somatic mutations with F1-measure ranges from 75.9 to 98.6% depending on the tumor type. We have released the algorithm as a software package called ISOWN (Identification of SOmatic mutations Without matching Normal tissues). Conclusions: In this work, we describe the development, implementation, and validation of ISOWN, an accurate algorithm for predicting somatic mutations in cancer tissues in the absence of matching normal tissues. ISOWN is available as Open Source under Apache License 2.0 from https:\/\/github.com\/ikalatskaya\/ISOWN.","language":["Perl"],"publicationDOI":["10.1186\/s13073-017-0446-9"],"publicationTitle":["ISOWN: accurate somatic mutation identification in the absence of normal tissue controls"],"repoUpdatedDate":"2017-11-13T22:18:41Z","repoHomepage":"","institutions":["University of California Davis","University of Toronto","University of Edinburgh","Ontario Institute for Cancer Research"],"linkUrls":["github.com\/ikalatskaya\/ISOWN","www.ncbi.nlm.nih.gov\/projects\/gap\/cgi-bin\/study.cgi?study_id=phs000598.v2.p2","www.genecards.org\/cgi-bin\/carddisp.pl?gene=MUC4","dcc.icgc.org\/pcawg","portal.gdc.cancer.gov\/","dcc.icgc.org\/releases\/PCAWG\/cell_lines"],"license":"Apache License 2.0","repoCreationDate":"2016-10-17T20:25:01Z","_version_":1585444944237035520,"name":"ISOWN","id":65,"suggestNamePrefix":"ISOWN","repoDownloads":0,"publicationDate":["6\/6\/2017"],"repoForks":7,"authors":["Irina Kalatskaya","Quang M. Trinh","Melanie Spears","John D. McPherson","John M. S. Bartlett","Lincoln Stein"]},{"codeRepoURL":"https:\/\/github.com\/atiselsts\/spacescanner","repoDescription":"SpaceScanner: biological model optimization space scanner","repoName":"spacescanner","suggestName":"SpaceScanner","repo":"github","description":"Motivation: Due to their universal applicability, global stochastic optimization methods are popular for designing improvements of biochemical networks. The drawbacks of global stochastic optimization methods are: (i) no guarantee of finding global optima, (ii) no clear optimization run termination criteria and (iii) no criteria to detect stagnation of an optimization run. The impact of these drawbacks can be partly compensated by manual work that becomes inefficient when the solution space is large due to combinatorial explosion of adjustable parameters or for other reasons. Results: SpaceScanner uses parallel optimization runs for automatic termination of optimization tasks in case of consensus and consecutively applies a pre-defined set of global stochastic optimization methods in case of stagnation in the currently used method. Automatic scan of adjustable parameter combination subsets for best objective function values is possible with a summary file of ranked solutions. Availability and implementation: https:\/\/github.com\/atiselsts\/spacescanner.Contact: egils.stalidzans@lu.lv Supplementary information: Supplementary data are available at Bioinformatics online.","language":["Component Pascal"],"publicationDOI":["10.1093\/bioinformatics\/btx363"],"publicationTitle":["SpaceScanner: COPASI wrapper for automated management of global stochastic optimization experiments"],"repoUpdatedDate":"2017-08-18T20:16:33Z","repoHomepage":"","institutions":["University of Bristol","University of Latvia"],"linkUrls":["github.com\/atiselsts\/spacescanner.Contact:"],"license":"No License","repoCreationDate":"2016-01-12T18:45:11Z","_version_":1585445063021821952,"name":"SpaceScanner","id":69,"suggestNamePrefix":"SpaceScanner","repoDownloads":0,"publicationDate":["0"],"repoForks":0,"authors":["Atis Elsts","Agris Pentjuss","Egils Stalidzans"]},{"codeRepoURL":"https:\/\/github.com\/PapenfussLab\/CLOVE","repoDescription":"classification of higher-order structural variants from breakpoint data","repoName":"clove","suggestName":"CLOVE","repo":"github","description":"Background: A precise understanding of structural variants (SVs) in DNA is important in the study of cancer and population diversity. Many methods have been designed to identify SVs from DNA sequencing data. However, the problem remains challenging because existing approaches suffer from low sensitivity, precision, and positional accuracy. Furthermore, many existing tools only identify breakpoints, and so not collect related breakpoints and classify them as a particular type of SV. Due to the rapidly increasing usage of high throughput sequencing technologies in this area, there is an urgent need for algorithms that can accurately classify complex genomic rearrangements (involving more than one breakpoint or fusion). Results: We present CLOVE, an algorithm for integrating the results of multiple breakpoint or SV callers and classifying the results as a particular SV. CLOVE is based on a graph data structure that is created from the breakpoint information. The algorithm looks for patterns in the graph that are characteristic of more complex rearrangement types. CLOVE is able to integrate the results of multiple callers, producing a consensus call. Conclusions: We demonstrate using simulated and real data that re-classified SV calls produced by CLOVE improve on the raw call set of existing SV algorithms, particularly in terms of accuracy. CLOVE is freely available from http:\/\/www.github.com\/PapenfussLab.","language":["Java"],"publicationDOI":["10.1186\/s12859-017-1760-3"],"publicationTitle":["CLOVE: classification of genomic fusions into structural variation events"],"repoUpdatedDate":"2017-10-06T23:17:27Z","repoHomepage":"","institutions":["Peter MacCallum Cancer Centre","University of Melbourne","G Royal Parade","Johannes Gutenberg Universität Mainz"],"linkUrls":["www.github.com\/PapenfussLab","www.ncbi.nlm.nih.gov\/sra\/SRX803011"],"license":"No License","repoCreationDate":"2015-08-21T04:55:16Z","_version_":1585445313142849536,"name":"CLOVE","id":72,"suggestNamePrefix":"CLOVE","repoDownloads":0,"publicationDate":["7\/13\/2017"],"repoForks":1,"authors":["Jan Schröder","Adrianto Wirawan","Bertil Schmidt","Anthony T. Papenfuss"]},{"codeRepoURL":"https:\/\/github.com\/OpenGene\/CfdnaPattern","repoDescription":"Pattern Recognition for Cell-free DNA","repoName":"CfdnaPattern","suggestName":"CfdnaPattern","repo":"github","description":"-Plasma cell-free DNA (cfDNA) has certain fragmentation patterns, which can bring non-random base content curves of the sequencing data's beginning cycles. We studied the patterns and found that we could determine whether a sample is cfDNA or not by just looking into the first 10 cycles of its base content curves. We analysed 3189 FastQ files, including 1442 cfDNA, 1234 genomic DNA, 507 FFPE tumour DNA and 6 urinary cfDNA. By deep analysing these data, we find the patterns are stable enough to distinguish cfDNA from other kinds of DNA samples. Based on this finding, we build classification models to recognise cfDNA samples by their sequencing data. Pattern recognition models are then trained with different classification algorithms like k-nearest neighbours (KNN), random forest and support vector machine (SVM). The result of 1000 iteration .632+ bootstrapping shows that all these classifiers can give an average accuracy higher than 98%, indicating that the cfDNA patterns are unique and can make the dataset highly separable. The best result is obtained using random forest classifier with a 99.89% average accuracy ( = 0:00068). A tool called CfdnaPattern (http:\/\/github.com\/OpenGene\/CfdnaPattern) has been developed to train the model and to predict whether a sample is cfDNA or not.","language":["Python"],"publicationDOI":["10.1109\/TCBB.2017.2723388"],"publicationTitle":["A Study of Cell-free DNA Fragmentation Pattern and Its Application in DNA Sample Type Classification"],"repoUpdatedDate":"2017-11-17T12:26:44Z","repoHomepage":"","linkUrls":["github.com\/OpenGene\/CfdnaPattern"],"license":"https:\/\/github.com\/OpenGene\/CfdnaPattern\/blob\/master\/LICENSE","repoCreationDate":"2016-07-28T03:09:46Z","_version_":1585445088376389632,"name":"CfdnaPattern","id":70,"suggestNamePrefix":"CfdnaPattern","repoDownloads":0,"publicationDate":["0"],"repoForks":14},{"codeRepoURL":"https:\/\/github.com\/ryusukemomota\/nanatex","repoDescription":"Network of Anatomical Texts","repoName":"nanatex","suggestName":"nanatex","repo":"github","description":"Anatomy is the science and art of understanding the structure of the body and its components in relation to the functions of the whole-body system. Medicine is based on a deep understanding of anatomy, but quite a few introductory-level learners are overwhelmed by the sheer amount of anatomical terminology that must be understood, so they regard anatomy as a dull and dense subject. To help them learn anatomical terms in a more contextual way, we started a new open-source project, the Network of Anatomical Texts (NAnaTex), which visualizes relationships of body components by integrating text-based anatomical information using Cytoscape, a network visualization software platform. Here, we present a network of bones and muscles produced from literature descriptions. As this network is primarily text-based and does not require any programming knowledge, it is easy to implement new functions or provide extra information by making changes to the original text files. To facilitate collaborations, we deposited the source code files for the network into the GitHub repository (https:\/\/github.com\/ryusukemomota\/nanatex) so that anybody can participate in the evolution of the network and use it for their own nonprofit purposes. This project should help not only introductory-level learners but also professional medical practitioners, who could use it as a quick reference.","language":[""],"publicationDOI":["10.1007\/s12565-017-0410-1"],"publicationTitle":["Network of anatomical texts (NAnaTex), an open-source project for visualizing the interaction between anatomical terms"],"repoUpdatedDate":"2017-07-28T11:20:37Z","repoHomepage":"","institutions":["& Ryusuke Momota","Dentistry and Pharmaceutical Sciences"],"linkUrls":["github.com\/ryusukemomota\/nanatex","www.med.umich.edu\/lrc\/coursepages\/m1\/anatomy2010\/html\/anatomytables\/"],"license":"No License","repoCreationDate":"2017-02-23T00:53:55Z","_version_":1585445321469591552,"name":"nanatex","id":73,"suggestNamePrefix":"nanatex","repoDownloads":0,"publicationDate":["7\/16\/2017"],"repoForks":1,"authors":["Ryusuke Momota","Aiji Ohtsuka","GitHub"]},{"codeRepoURL":"https:\/\/github.com\/EBjerrum\/pICalculax","repoDescription":"Isoelectric point (pI) predictor for chemically modified peptides and proteins.","repoName":"pICalculax","suggestName":"pICalculax","repo":"github","description":"The isoelectric point of a peptide is a physicochemical property that can be accurately predicted from the sequence of the peptide when the peptide is built from natural amino acids. Peptides can however have chemical modifications, such as phosphorylations, amidations, and unnatural amino acids, which can result in erroneous predictions if not accounted for. Here we report on an open source program, pICalculax, which in an extensible way can handle pI calculations of modified peptides. Tests on a database of modified peptides and experimentally determined pI values show an improvement in pI predictions when taking the modifications into account. The correlation coefficient improves from 0.45 to 0.91, and the root-mean-square deviation likewise improves from 3.3 to 0.9. The program is available at https:\/\/github.com\/EBjerrum\/pICalculax","language":["Python"],"publicationDOI":["10.1021\/acs.jcim.7b00030"],"publicationTitle":["pICalculax: Improved Prediction of Isoelectric Point for Modified Peptides"],"repoUpdatedDate":"2017-01-18T10:38:09Z","repoHomepage":"","institutions":["Biochemfusion Aps","Wildcard Pharmaceutical Consulting","Zealand Pharma A\/S"],"linkUrls":["github.com\/EBjerrum\/pICalculax"],"license":"BSD 3-clause \"New\" or \"Revised\" License","repoCreationDate":"2016-12-23T09:52:04Z","_version_":1585444994823487488,"name":"pICalculax","id":67,"suggestNamePrefix":"pICalculax","repoDownloads":0,"publicationDate":["1\/16\/2017"],"repoForks":0,"authors":["Esben J. Bjerrum","Jan H. Jensen","Jakob L. Tolborg"]},{"codeRepoURL":"https:\/\/github.com\/VTcbil\/FASP","repoDescription":"Functional AStrocyte Phenotyping (FASP) is a Fiji plugin that automatically analyzes and characterizes the spatiotemporal functional status of astrocytes from time-lapse Ca2+ imaging data. FASP has been updated to analyze more complex data, especially in-vivo data. The new version is available upon request to Prof. Yu (yug@vt.edu).","repoName":"FASP","suggestName":"FASP","repo":"github","description":"Recent discoveries that astrocytes exert proactive regulatory effects on neural information processing and that they are deeply involved in normal brain development and disease pathology have stimulated broad interest in understanding astrocyte functional roles in brain circuit. Measuring astrocyte functional status is now technically feasible, due to recent advances in modern microscopy and ultrasensitive cell-type specific genetically encoded Ca2+ indicators for chronic imaging. However, there is a big gap between the capability of generating large dataset via calcium imaging and the availability of sophisticated analytical tools for decoding the astrocyte function. Current practice is essentially manual, which not only limits analysis throughput but also risks introducing bias and missing important information latent in complex, dynamic big data. Here, we report a suite of computational tools, called Functional AStrocyte Phenotyping (FASP), for automatically quantifying the functional status of astrocytes. Considering the complex nature of Ca2+ signaling in astrocytes and low signal to noise ratio, FASP is designed with data-driven and probabilistic principles, to flexibly account for various patterns and to perform robustly with noisy data. In particular, FASP explicitly models signal propagation, which rules out the applicability of tools designed for other types of data. We demonstrate the effectiveness of FASP using extensive synthetic and real data sets. The findings by FASP were verified by manual inspection. FASP also detected signals that were missed by purely manual analysis but could be confirmed by more careful manual examination under the guidance of automatic analysis. All algorithms and the analysis pipeline are packaged into a plugin for Fiji (ImageJ), with the source code freely available online at https:\/\/github.com\/VTcbil\/FASP.","language":["Java"],"publicationDOI":["10.3389\/fninf.2017.00048"],"publicationTitle":["Automated Functional Analysis of Astrocytes from Chronic Time-Lapse Calcium Imaging Data"],"repoUpdatedDate":"2017-11-15T19:19:25Z","repoHomepage":"","institutions":["Virginia Polytechnic Institute and State University","Co-first author","University of California Davis School of Medicine","Pennsylvania State University","National Institute of Standards and Technology"],"linkUrls":["github.com\/VTcbil\/FASP"],"license":"No License","repoCreationDate":"2016-05-25T14:12:40Z","_version_":1585445414075629568,"name":"FASP","id":76,"suggestNamePrefix":"FASP","repoDownloads":0,"publicationDate":["0"],"repoForks":1,"authors":["Yinxue Wang","Guilai Shi","David J. Miller","Yizhi Wang","Congchao Wang","Gerard Broussard","Yue Wang","Lin Tian","Guoqiang Yu"]},{"codeRepoURL":"https:\/\/github.com\/behroozt\/PiiL","repoDescription":"Pathway interactive visualization tool. For documentation see: http:\/\/behroozt.github.io\/PiiL\/","repoName":"PiiL","suggestName":"PiiL","repo":"github","description":"Background: DNA methylation is a major mechanism involved in the epigenetic state of a cell. It has been observed that the methylation status of certain CpG sites close to or within a gene can directly affect its expression, either by silencing or, in some cases, up-regulating transcription. However, a vertebrate genome contains millions of CpG sites, all of which are potential targets for methylation, and the specific effects of most sites have not been characterized to date. To study the complex interplay between methylation status, cellular programs, and the resulting phenotypes, we present PiiL, an interactive gene expression pathway browser, facilitating analyses through an integrated view of methylation and expression on multiple levels. Results: PiiL allows for specific hypothesis testing by quickly assessing pathways or gene networks, where the data is projected onto pathways that can be downloaded directly from the online KEGG database. PiiL provides a comprehensive set of analysis features that allow for quick and specific pattern searches. Individual CpG sites and their impact on host gene expression, as well as the impact on other genes present in the regulatory network, can be examined. To exemplify the power of this approach, we analyzed two types of brain tumors, Glioblastoma multiform and lower grade gliomas. Conclusion: At a glance, we could confirm earlier findings that the predominant methylation and expression patterns separate perfectly by mutations in the IDH genes, rather than by histology. We could also infer the IDH mutation status for samples for which the genotype was not known. By applying different filtering methods, we show that a subset of CpG sites exhibits consistent methylation patterns, and that the status of sites affect the expression of key regulator genes, as well as other genes located downstream in the same pathways. PiiL is implemented in Java with focus on a user-friendly graphical interface. The source code is available under the GPL license from https:\/\/github.com\/behroozt\/PiiL.git.","language":["Java"],"publicationDOI":["10.1186\/s12864-017-3950-9"],"publicationTitle":["PiiL: visualization of DNA methylation and gene expression data in gene pathways"],"repoUpdatedDate":"2016-11-01T18:06:51Z","repoHomepage":"","institutions":["Uppsala University","Uppsala University","Umeå University","Polish Academy of Sciences"],"linkUrls":["www.ncbi.nlm.nih.gov\/pubmed","github.com\/behroozt\/PiiL.git","gdc-portal.nci.nih.gov\/legacy-archive\/search\/f","github.com\/behroozt\/PiiL"],"license":"GNU General Public License v3.0","repoCreationDate":"2016-01-13T09:52:33Z","_version_":1585445381622202368,"name":"PiiL","id":75,"suggestNamePrefix":"PiiL","repoDownloads":0,"publicationDate":["7\/18\/2017"],"repoForks":0,"authors":["Behrooz Torabi Moghadam","Neda Zamani","Jan Komorowski","Manfred Grabherr"]},{"codeRepoURL":"https:\/\/github.com\/raunaq-m\/MultiRes","repoDescription":"Frame Based Error Correction Algorithm Viral Populations","repoName":"MultiRes","suggestName":"MultiRes.","repo":"github","description":"A B S T R A C T We propose a random forest classifier for detecting rare variants from sequencing errors in Next Generation Sequencing (NGS) data from viral populations. The method utilizes counts of varying length of k-mers from the reads of a viral population to train a Random forest classifier, called MultiRes, that classifies k-mers as erroneous or rare variants. Our algorithm is rooted in concepts from signal processing and uses a framebased representation of k-mers. Frames are sets of non-orthogonal basis functions that were traditionally used in signal processing for noise removal. We define discrete spatial signals for genomes and sequenced reads, and show that k-mers of a given size constitute a frame. We evaluate MultiRes on simulated and real viral population datasets, which consist of many low frequency variants, and compare it to the error detection methods used in correction tools known in the literature. MultiRes has 4 to 500 times less false positives k-mer predictions compared to other methods, essential for accurate estimation of viral population diversity and their de-novo assembly. It has high recall of the true kmers, comparable to other error correction methods. MultiRes also has greater than 95% recall for detecting single nucleotide polymorphisms (SNPs) and fewer false positive SNPs, while detecting higher number of rare variants compared to other variant calling methods for viral populations. The software is available freely from the GitHub link https:\/\/github.com\/raunaq-m\/MultiRes.© 2017 The Authors. Published by Elsevier B.V. This is an open access article under the CC BY license (http:\/\/creativecommons.org\/licenses\/by\/4.0\/).","language":["C++"],"publicationDOI":["10.1016\/j.csbj.2017.07.001"],"publicationTitle":["A random forest classifier for detecting rare variants in NGS data from viral populations"],"repoUpdatedDate":"2017-05-31T17:01:47Z","repoHomepage":"http:\/\/arxiv.org\/abs\/1604.04803","institutions":["The Pennsylvania State University","Indiana University"],"linkUrls":["github.com\/raunaq-m\/MultiRes.©","github.com\/raunaq-m\/MultiRes","github.com\/nh13\/DWGSIM"],"license":"GNU General Public License v2.0","repoCreationDate":"2016-01-15T19:47:36Z","_version_":1585445520529162240,"name":"MultiRes.","id":82,"suggestNamePrefix":"MultiRes.","repoDownloads":0,"publicationDate":["7\/3\/2017"],"repoForks":0,"authors":["Raunaq Malhotra","Manjari Jha","Mary Poss","Raj Acharya"]},{"codeRepoURL":"https:\/\/github.com\/fenghen360\/HomBlocks","repoDescription":"HomBlocks: A multiple-alignment construction pipeline for organelle phylogenomics based on locally collinear block searching","repoName":"HomBlocks","suggestName":"HomBlocks","repo":"github","description":"A B S T R A C T Organelle phylogenomic analysis requires precisely constructed multi-gene alignment matrices concatenated by pre-aligned single gene datasets. For non-bioinformaticians, it can take days to weeks to manually create highquality multi-gene alignments comprising tens or hundreds of homologous genes. Here, we describe a new and highly efficient pipeline, HomBlocks, which uses a homologous block searching method to construct multiple sequence alignment. This approach can automatically recognize locally collinear blocks among organelle genomes and excavate phylogenetically informative regions to construct multiple sequence alignment in a few hours. In addition, HomBlocks supports organelle genomes without annotation and makes adjustment to different taxon datasets, thereby enabling the inclusion of as many common genes as possible. Topology comparison of trees built by conventional multi-gene and HomBlocks alignments implemented in different taxon categories shows that the same efficiency can be achieved by HomBlocks as when using the traditional method. The availability of Homblocks makes organelle phylogenetic analyses more accessible to non-bioinformaticians, thereby promising to lead to a better understanding of phylogenic relationships at an organelle genome level. Availability and implementation: HomBlocks is implemented in Perl and is supported by Unix-like operative systems, including Linux and macOS. The Perl source code is freely available for download from https:\/\/github.com\/fenghen360\/HomBlocks.git, and documentation and tutorials are available at https:\/\/github.com\/fenghen360\/HomBlocks. Contact: yxmao@ouc.edu.cn or fenghen360@126.com","language":["Python"],"publicationDOI":["10.1016\/j.ygeno.2017.08.001"],"publicationTitle":["HomBlocks: A multiple-alignment construction pipeline for organelle phylogenomics based on locally collinear block searching"],"repoUpdatedDate":"2017-10-12T08:20:25Z","repoHomepage":"","institutions":["Ocean University of China","Ministry of Education","Qingdao National Laboratory for Marine Science and Technology"],"linkUrls":["github.com\/fenghen360\/HomBlocks.git,","github.com\/fenghen360\/HomBlocks"],"license":"No License","repoCreationDate":"2017-02-23T06:22:53Z","_version_":1585445452445122560,"name":"HomBlocks","id":79,"suggestNamePrefix":"HomBlocks","repoDownloads":0,"publicationDate":["8\/2\/2017"],"repoForks":4,"authors":["Guiqi Bi","Yunxiang Mao","Qikun Xing","Min Cao"]},{"codeRepoURL":"https:\/\/github.com\/StuntsPT\/Structure_threader","repoDescription":"A wrapper program to parallelize and automate runs of \"Structure\", \"fastStructure\" and \"MavericK\".","repoName":"Structure_threader","suggestName":"Structure_threader","repo":"github","description":"Structure_threader is a program to parallelize multiple runs of genetic clustering software that does e not make use of multi-threading technology (STRUCTURE, FASTSTRUCTURE and MavericK) on multi-core comcputers. Our approach was benchmarked across multiple systems and displayed great speed improvements relative to the single threaded implementation, scaling very close to linearly with the numcber of physical cores used.","language":["Python"],"publicationDOI":["10.1111\/1755-0998.12702"],"publicationTitle":[""],"repoUpdatedDate":"2017-11-10T18:01:03Z","repoHomepage":"","institutions":["National Institute of Health Dr Ricardo Jorge","PT. d Keywords: Bioinfomatics\/Phyloinfomatics"],"linkUrls":["doi.org\/10.1109\/HiPC.2011.6152743","doi.org\/10.1038\/nature15393","github.com\/StuntsPT\/Structure_threader"],"license":"GNU General Public License v3.0","repoCreationDate":"2015-03-03T12:56:42Z","_version_":1585445443496574976,"name":"Structure_threader","id":78,"suggestNamePrefix":"Structure_threader","repoDownloads":0,"publicationDate":["0"],"repoForks":4},{"codeRepoURL":"https:\/\/github.com\/bwringe\/hybriddetective","repoDescription":"","repoName":"hybriddetective","suggestName":"l hybriddetective","repo":"github","description":"r","language":["R"],"publicationDOI":["10.1111\/1755-0998.12704"],"publicationTitle":["l hybriddetective: a workflow and package c to facilitate the detection of hybridization i utsing genomic data in R"],"repoUpdatedDate":"2017-08-10T21:32:17Z","repoHomepage":"","institutions":["National Oceanic and Atmospheric Administration Southwest Fis","Department of Fisheries and Oceans Canada","heries Science Center","n'sNL"],"linkUrls":["github.com\/bwringe\/hybriddetective","github.com\/bwringe\/parallelnewhybrid"],"license":"No License","repoCreationDate":"2016-02-29T15:52:43Z","_version_":1585445430119890944,"name":"l hybriddetective","id":77,"suggestNamePrefix":"l hybriddetective","repoDownloads":0,"publicationDate":["0"],"repoForks":4,"authors":["Brendan F. Wringe","Ryan R. E. Stanley","Nicholas W. Jeffery","Eric C. Anderson","Ian R. Bradbury"]},{"codeRepoURL":"https:\/\/github.com\/IcarPA-TBlab\/nRC","repoDescription":"nRC: non-coding RNA Classifier","repoName":"nrc","suggestName":"nRC","repo":"github","description":"Motivation: Non-coding RNA (ncRNA) are small non-coding sequences involved in gene expression regulation of many biological processes and diseases. The recent discovery of a large set of different ncRNAs with biologically relevant roles has opened the way to develop methods able to discriminate between the different ncRNA classes. Moreover, the lack of knowledge about the complete mechanisms in regulative processes, together with the development of high-throughput technologies, has required the help of bioinformatics tools in addressing biologists and clinicians with a deeper comprehension of the functional roles of ncRNAs. In this work, we introduce a new ncRNA classification tool, nRC (non-coding RNA Classifier). Our approach is based on features extraction from the ncRNA secondary structure together with a supervised classification algorithm implementing a deep learning architecture based on convolutional neural networks. Results: We tested our approach for the classification of 13 different ncRNA classes. We obtained classification scores, using the most common statistical measures. In particular, we reach an accuracy and sensitivity score of about 74%. Conclusion: The proposed method outperforms other similar classification methods based on secondary structure features and machine learning algorithms, including the RNAcon tool that, to date, is the reference classifier. nRC tool is freely available as a docker image at https:\/\/hub.docker.com\/r\/tblab\/nrc\/. The source code of nRC tool is also available at https:\/\/github.com\/IcarPA-TBlab\/nrc.","language":["Python"],"publicationDOI":["10.1186\/s13040-017-0148-2"],"publicationTitle":["nRC: non-coding RNA Classifier based on structural features"],"repoUpdatedDate":"2017-08-17T19:52:34Z","repoHomepage":"","linkUrls":["github.com\/IcarPA-TBlab\/nrc,","hub.docker.com\/r\/tblab\/nrc\/","github.com\/IcarPA-TBlab\/nrc"],"license":"GNU General Public License v3.0","repoCreationDate":"2017-01-19T15:10:57Z","_version_":1585445470780522496,"name":"nRC","id":80,"suggestNamePrefix":"nRC","repoDownloads":0,"publicationDate":["7\/24\/2017"],"repoForks":0,"authors":["Antonino Fiannaca","Massimo La Rosa","Laura La Paglia","Riccardo Rizzo","Alfonso Urso"]},{"codeRepoURL":"https:\/\/github.com\/xiaofengsong\/GFusion","repoDescription":"GFusion is a software package to detect fusion genes using RNA-Seq data","repoName":"GFusion","suggestName":"GFusion","repo":"github","description":"OPEN Fusion gene derived from genomic rearrangement plays a key role in cancer initiation. The discovery of novel gene fusions may be of significant importance in cancer diagnosis and treatment. Meanwhile, next generation sequencing technology provide a sensitive and ecfiient way to identify gene fusions in genomic levels. However, there are still many challenges and limitations remaining in the existing methods which only rely on unmapped reads or discordant alignment fragments. In this work we have developed GFusion, a novel method using RNA-Seq data, to identify the fusion genes. This pipeline performs multiple alignments and strict filtering algorithm to improve sensitivity and reduce the false positive rate. GFusion successfully detected 34 from 43 previously reported fusions in four cancer datasets. We also demonstrated the efectiveness of GFusion using 24 million 76 bp paired-end reads simulation data which contains 42 artificial fusion genes, among which GFusion successfully discovered 37 fusion genes. Compared with existing methods, GFusion presented higher sensitivity and lower false positive rate. The GFusion pipeline can be accessed freely for non-commercial purposes at: https:\/\/github.com\/xiaofengsong\/GFusion.","language":["Perl"],"publicationDOI":["10.1038\/s41598-017-07070-6"],"publicationTitle":["GFusion: an Efective Algorithm to Identify Fusion Genes from Cancer RNA-Seq Data"],"repoUpdatedDate":"2017-08-05T20:05:05Z","repoHomepage":"","linkUrls":["github.com\/xiaofengsong\/GFusion"],"license":"No License","repoCreationDate":"2016-02-19T03:24:05Z","_version_":1585445353256124416,"name":"GFusion","id":74,"suggestNamePrefix":"GFusion","repoDownloads":0,"publicationDate":["6\/22\/2017"],"repoForks":2,"authors":["Jian Zhao","Qi Chen","Jing Wu","Ping Han","Xiaofeng Song"]},{"codeRepoURL":"https:\/\/github.com\/tsudalab\/MDTS","repoDescription":"Materials Design by Monte Carlo Tree Search","repoName":"MDTS","suggestName":"MDTS","repo":"github","description":"","language":["Python"],"publicationDOI":["10.1080\/14686996.2017.1344083"],"publicationTitle":["MDTS: automatic complex materials design using Monte Carlo tree search"],"repoUpdatedDate":"2017-11-01T06:12:04Z","repoHomepage":"","linkUrls":["github.com\/tsudalab\/MDTS"],"license":"No License","repoCreationDate":"2017-03-22T04:03:56Z","_version_":1585445480779743232,"name":"MDTS","id":81,"suggestNamePrefix":"MDTS","repoDownloads":0,"publicationDate":["0"],"repoForks":0,"authors":["Thaer M. Dieb","Shenghong Ju","Kazuki Yoshizoe","Zhufeng Hou","Junichiro Shiomi","Koji Tsuda","The Author",". Published by Informa UK Limited","trading as Taylor","Francis Group"]},{"codeRepoURL":"https:\/\/github.com\/GreenleafLab\/motifmatchr","repoDescription":"Fast motif matching in R","repoName":"motifmatchr","suggestName":"chromVar ","repo":"github","description":"single-cell atac -seq (scatac ) yields sparse data that make conventional analysis challenging. We developed chromVar (http:\/\/www.github.com\/GreenleafLab\/chromVa r ), an r package for analyzing sparse chromatin-accessibility data by estimating gain or loss of accessibility within peaks sharing the same motif or annotation while controlling for technical biases. chromVar enables accurate clustering of scatac -seq profiles and characterization of known and de novo sequence motifs associated with variation in chromatin accessibility.","language":["C++"],"publicationDOI":["10.1038\/nmeth.4401"],"publicationTitle":["chromVar : inferring transcription-factor- associated accessibility from single-cell epigenomic data"],"repoUpdatedDate":"2017-08-11T08:34:33Z","repoHomepage":"https:\/\/greenleaflab.github.io\/motifmatchr\/","institutions":["Broad Institute of MIT and Harvard","Stanford University","Stanford University School of Medicine","Harvard University"],"linkUrls":["egg2.wustl.edu\/roadmap\/web_portal\/","bioconductor.org\/packages\/devel\/bioc\/html\/motifmatchr.html","CRAN.R-project.org\/package=Rtsne","www.github.com\/GreenleafLab\/motifmatchr","www.github.com\/GreenleafLab\/chromVa","www.github.com\/GreenleafLab\/chromVAR","www.nature.com\/reprints\/index.html"],"license":"GNU General Public License v3.0","repoCreationDate":"2017-01-19T20:17:16Z","_version_":1585445636637982720,"name":"chromVar ","id":83,"suggestNamePrefix":"chromVar ","repoDownloads":0,"publicationDate":["0"],"repoForks":4,"authors":["Alicia N Schep","Beijing Wu","Jason D Buenrostro","William J Greenleaf"]},{"codeRepoURL":"https:\/\/github.com\/njau-sri\/rtm-gwas","repoDescription":"An innovative GWAS procedure for studies on germplasm population and plant breeding","repoName":"rtm-gwas","suggestName":"rtm-gwas","repo":"github","description":"The previous genome-wide association studies (GWAS) have been concentrated on finding a handful of major quantitative trait loci (QTL), but plant breeders Vol.:(011233456789)","language":["C++"],"publicationDOI":["10.1007\/s00122-017-2962-9"],"publicationTitle":["An innovative procedure of genome‑wide association analysis fits studies on germplasm population and plant breeding"],"repoUpdatedDate":"2017-10-24T10:24:11Z","repoHomepage":"","institutions":["Communicated by Dr. Mikko J. Sillanpaa","Nanjing Agricultural University","Ministry of Agriculture","BGI-Shenzhen"],"linkUrls":["github.com\/njau-sri\/rtm-gwas"],"license":"MIT License","repoCreationDate":"2016-11-24T08:11:27Z","_version_":1585445660678684672,"name":"rtm-gwas","id":84,"suggestNamePrefix":"rtm-gwas","repoDownloads":0,"publicationDate":["8\/1\/2017"],"repoForks":0,"authors":["Jianbo He","Shan Meng","Tuanjie Zhao","Guangnan Xing","Shouping Yang","Yan Li","Rongzhan Guan","Jiangjie Lu","Yufeng Wang","Qiuju Xia","Bing Yang","Junyi Gai"]},{"codeRepoURL":"https:\/\/github.com\/dpxiong\/HHConPred","repoDescription":"","repoName":"HHConPred","suggestName":"HHConPred","repo":"github","description":"Helix-helix interactions are crucial in the structure assembly, stability and function of helix-rich proteins including many membrane proteins. In spite of remarkable progresses over the past decades, the accuracy of predicting protein structures from their amino acid sequences is still far from satisfaction. In this work, we focused on a simpler problem, the prediction of helix-helix interactions, the results of which could facilitate practical protein structure prediction by constraining the sampling space. Specifically, we started from the noisy 2D residue contact maps derived from correlated residue mutations, and utilized ridge detection to identify the characteristic residue contact patterns for helix-helix interactions. The ridge information as well as a few additional features were then fed into a machine learning model HHConPred to predict interactions between helix pairs. In an independent test, our method achieved an F-measure of 60% for predicting helixhelix interactions. Moreover, although the model was trained mainly using soluble proteins, it could be extended to membrane proteins with at least comparable performance relatively to previous approaches that were generated purely using membrane proteins. All data and source codes are available at http:\/\/166.111.152.91\/Downloads.html or https:\/\/github.com\/dpxiong\/HHConPred.","language":["Python"],"publicationDOI":["10.1002\/prot.25370"],"publicationTitle":["Predicting the helix-helix interactions from correlated residue mutations"],"repoUpdatedDate":"2017-07-31T03:08:24Z","repoHomepage":"","institutions":["Tsinghua University"],"linkUrls":["orcid.org\/0000-0002-5532-1640","github.com\/dpxiong\/HHConPred"],"license":"No License","repoCreationDate":"2017-07-31T03:00:31Z","_version_":1585445673887596544,"name":"HHConPred","id":85,"suggestNamePrefix":"HHConPred","repoDownloads":0,"publicationDate":["0"],"repoForks":0,"authors":["Dapeng Xiong","Haipeng Gong"]}],"numFound":85,"start":0},"responseHeader":{"QTime":0,"params":{"q":"*:*","indent":"true","rows":"100000","wt":"json"},"status":0}}